{"product_url": "https://www.amazon.com/Extra-Virgin-Pressed-Olive-Oil/dp/B0155W3W7A", "product_name": "Extra Virgin First Cold Pressed Olive Oil 500ml (17 fl oz) (Extra Virgin)", "description": "100% single sourced estate-owned EVOO made with pressed Koroneiki olives  Picked the old-fashioned way from the island of Crete, cold pressed, and hand bottled  Deliciously full-bodied taste has distinctive flavor with no bitterness or bad aftertaste  High smoke point makes our product perfect for all types of cooking with old world Greek flavor  Certified extra-virgin by chemical analysis showing an acidity between .2 and .4 %.", "price": null, "currency": "$", "product_rating": 4.4, "Color": ["initial"], "availability": false, "shipping": false, "delivery_date": null, "delivery_cost": null, "warranty": false, "warranty_policy": null, "condition": "new", "image": "https://m.media-amazon.com/images/I/41uVaKhGQlL._SX300_SY300_QL70_ML2_.jpg", "latest_reviews": ["Fabulous oil! We started using Kofinis Oil when we lived in Cincinnati where the company has its US stores. We love it, and continue to but it and use it, even though we have moved away. It has great flavor and works well with all the cooking and marinating that I do. Visit their web store to see all the different oils that they have. You won't be disappointed!", "Best olive oil on the market I used to be able to find this olive oil at a local market, and they stopped carrying it, which was heartbreaking!  I was so happy to find it available on Amazon.  This olive oil has such a great flavor you could drink it right out of the bottle.  Great for cooking, salads, etc.  I've been buying this olive oil for years, and it never disappoints.", "EVOO in plastic bottle disappointing The flavor was good, the pouring spout is poorly designed and caused a lot of spillage, the plastic bottle was the biggest disappointment - I would not buy this again and would have gladly paid extra for this product if was in a dark colored glass or tin container. Do a google search on EVOO in plastic vs. tin or glass if you are wondering.", "Flavor flavor flavor I add this to everything salads.Pasta's dressings I use for Caprise a salad.Love love the taste great value for the price a little goes a long way on flavor", "Excellent oil & taste Excellent oil & taste, however disappointed it came in plastic bottles?  these didn't look like plastic, although I didn't think they would be... usually good oil is in glass or tin.  SIgh, may just use for moisturizer for my kids."]}