{"product_url": "https://www.amazon.com/théa-Koroneiki-Antioxidants-Unblended-Handpicked/dp/B07N8HWJ11", "product_name": "théa Premium Greek Extra Virgin Olive Oil (750ml) I NEW Harvest 2023/2024 I Koroneiki Variety I First Cold Pressed I Low Acidity I Unblended I Handpicked &amp; Harvested in Kalamata, Greece", "description": "For over four generations our family has been harvesting olives in the foothills of the Peloponnese region of southern Greece. théa olive oil is sourced from our olive groves in Kalamata, Greece, which is world famous for producing some of the best extra virgin olive oil in the world.", "price": "17.99", "currency": "$", "product_rating": "4.6", "Color": [], "availability": true, "shipping": false, "delivery_date": null, "delivery_cost": null, "warranty": false, "warranty_policy": null, "condition": "new", "image": "https://m.media-amazon.com/images/I/3157a0e7fdL._SX300_SY300_QL70_ML2_.jpg", "latest_reviews": [{"reviewTitle": "The best greek olive oil, bar none!", "reviewBody": "Light but tasteful. I use this brand everyday.", "rating": 5, "reviewDate": "December 1, 2024"}, {"reviewTitle": "Great flavor", "reviewBody": "Very good olive oil, a little pricey but not out of line for quality olive oil", "rating": 5, "reviewDate": "August 8, 2024"}, {"reviewTitle": "Superb flavor profile", "reviewBody": "After spending some weeks traveling and eating in Greece last year, I had acquired a recognition of the flavor profile differences between Greek olive oils and the Italian olive oils that I grew up with.  I enjoy both, but I only buy Italian oil when I am in Italy. My problem with Italian olive oils purchased here in the USA  is that producers are allowed to use olives and even olive oils from other countries and “finish” the production and bottling in Italy and then they are allowed to call it “Italian Olive Oil”.  The Greek oils are far less subject to that sort of adulteration.  This oil is 100% Greek origin and production, and it is dated.  Very transparent and I expect that.  I was exceptionally pleased with my purchase of the Théa Greek olive oil.  The light “grassiness” in the aroma is exactly what I experienced with all the Greek oils I tasted in Greece.  It has a balanced finish, not distinctly peppery, and I like that for many applications.  Also, the olive flavor does not hit you hard like many true Italian oils do, so I can use the Greek oil in sweet preparations, like an olive oil cake, and not have it come out over-olivey.  Great product.", "rating": 5, "reviewDate": "June 27, 2023"}, {"reviewTitle": "Great and Beautiful Bottle of Olive Oil", "reviewBody": "Great quality olive oil, beautiful bottle if you want to give it as a gift as well, and great customer service and straight from Greece. Nothing like a good olive oil that you actually know where it is coming from, one source. So many fake olive oils out there that tells you the oil come from one of the following countries and they list multiple countries and you don’t know the quality or the harvest year, those are not pure olive oils, and this one actually gives you a harvest date. This one you can tell that its a family business and straight from Greece best olive oil out there ⭐️⭐️⭐️⭐️⭐️ at a great price.", "rating": 5, "reviewDate": "March 27, 2023"}, {"reviewTitle": "Great taste but…", "reviewBody": "The taste is  great but there is not harvest date in the bottle like it shows it in the picture advertising it, this is one of the main reason I bought it and it’s not there please I need a response on this.", "rating": 4, "reviewDate": "March 14, 2024"}, {"reviewTitle": "This oil was good", "reviewBody": "Oil was good", "rating": 5, "reviewDate": "October 30, 2024"}, {"reviewTitle": "Love this!", "reviewBody": "No matter what it’s on, it’s delicious.", "rating": 5, "reviewDate": "October 23, 2024"}, {"reviewTitle": "They ship very fast!", "reviewBody": "Quality product that arrives the next day after you order it!", "rating": 5, "reviewDate": "June 30, 2024"}]}