{"product_url": "https://www.amazon.com/LaRambla-Virgin-Special-Coupage-Product/dp/B07TN2S7YZ", "product_name": "LaRambla Extra Virgin Olive Oil, One US Gallon, Special Coupage, First Cold Press, Product of Spain, 128 Fl Oz (Pack of 1)", "description": "Hazienda La Rambla is a small Spanish firm founded by a group of professionals with over 20 years experience in the processing, commercialization and export of natural foods, especially olive oils, vinegars, olives, dried fruits, artichokes etc. It is a relatively young enterprise passionate about tradition, nature and constant quality, producing with processes that do not harm the environment and always committed to a social project to improve the lot of the most needy. Mechanical methods, suitable temperatures, controlled pressing time, proper decantation process, and ideal storage conditions, all such care is synonymous with Hazienda La Rambla’s highest quality olive oils.", "price": "76.94", "currency": "$", "product_rating": "4.5", "Color": ["initial"], "availability": false, "shipping": false, "delivery_date": null, "delivery_cost": null, "warranty": false, "warranty_policy": null, "condition": "new", "image": "https://m.media-amazon.com/images/I/51OMXj7ZF-L._SX300_SY300_QL70_ML2_.jpg", "latest_reviews": ["Excellent","Olive Oil is a personal taste. Some like it stronger, some weaker. This is just right. Give it a try. You won’t be disappointed. Several of my, Italian, friends suggested I try Partanna Extra Virgin Olive Oil. No comparison. Never again will I use any other Olive Oil except LaRambla.","I received my EVOO and the can was severely dent and the top was blown upward from being dropped. I don't know if it was from shipping or poor quality control. I am happy to say that the seller responded immediately and shipped another can free of charge. I'm very satisfied with this seller's business practices","Ordered LaRambla for the Holidays and this is the Most Amazing Tasting oil there is.  We have tried many different oils from different countries, this oil beats them all. Everything tastes better with this oil.  Also first discovered this oil at Carrabba's Italian Restaurant and we were hooked and now that we have it home we are so Happy !","this evoo has a nice taste and great value","Delicious. Excellent seller also, used Starship seller only. Fast delivery.","I threw 60 bucks at a can of this oil because I was smitten with the idea of tasting that deliciousness from Carrabba's again. WRONG. It's olive oil, nothing more nothing less. Mediocre at best. Certainly not worth what I paid for it.\n\nI would've been better served buying some store brand olive oil from Meijer or Kroger for a third of the cost, that's basically what it is in my opinion.\n\nSure I'll keep it and use it, I use it every day as a matter of fact. But the title speaks for itself."]}