{"product_url": "https://www.amazon.com/Lodi-Frantoio-Extra-Virgin-Olive/dp/B07YBMRGKB", "product_name": "Lodi Frantoio Extra Virgin Olive Oil - Premium California Olive Oil - Gourmet Frantoio Olive Oil - COOC Certified Cold Pressed Pure Olive Oil - Medium to High Intensity - 500 ml", "description": "FRANTOIO EXTRA VIRGIN OLIVE OIL: Lodi Frantoio Olive Oil brings the best out of premium Frantoio Olives that are known around the world for their fruitiness; Layered flavor profile, pale golden color & rich, fruity aroma  MEDIUM TO SLIGHTLY HIGH INTENSITY: Our Frantoio Extra Olive Oil carries the fruity flavor of Frantoio Olives with subtle grassy notes & a late hint of green apple; Made from handpicked local Frantoio olives  COLD PRESSED EXTRA VIRGIN OLIVE OIL: Our extra virgin olive oils guarantee minimal processing through cutting-edge cold extraction techniques; Works amazingly well with simple & complex foods, from artisan breads to balsamic vinegars  MADE IN CALIFORNIA: All Lodi Olive Oil products are made in California to ensure the highest standards of quality, processing & packaging; COOC Certified California olive oil; No preservatives, trans-fats or added chemicals; Pure olive oil  THE COLDANI LEGACY: Lodi Olive Oil is a brand owned & run by the legendary Coldani family famous for their Lodi-Delta region olive groves; The finest olive oil experience, packaged in a tasteful new avatar; Click ‘Add to Cart’ to order", "price": "17.99", "currency": "$", "product_rating": "4.2", "Color": [], "availability": true, "shipping": false, "delivery_date": null, "delivery_cost": null, "warranty": false, "warranty_policy": null, "condition": "new", "image": "https://m.media-amazon.com/images/I/410MsYlgZFL._SX300_SY300_QL70_ML2_.jpg", "latest_reviews": ["Bought this as a housewarming gift for my mother-in-law, and she hasn't stopped raving about it. It has been great for finishing roast veggies and potatoes, as well as for dipping crusty sourdough bread. It is bright and clean, with a fantastic bite and grassiness. I'm ordering another bottle for our house.", "This is the best olive oil I’ve ever tasted. It’s absolutely bursting with bright green fresh fruity flavor and has zero bitterness. I just wish it were not so expensive.", "Looks like the brand didn't had COOC seal for 2021. I am not sure am I the one to receive this Oil without COOC seal, so I am looking for another Olive Oil which is certified by COOC", "Good quality olive oil", "Great product. Rich. Flavorful.", "Good quality olive oil"]}