{"product_url": "https://www.amazon.com/Georgia-Olive-Farms-Extra-Virgin/dp/B07641GK6H", "product_name": "GEORGIA OLIVE FARMS Extra Virgin Olive Oil, 16.9 FZ", "description": "<p> <p><span><br/>Are you on a strict health diet? If so, get ready to fall in love and do not miss out a pantry staple - Georgia Olivia Farms extra virgin olive oil! Our unfiltered EVOO (extra virgin olive oil) is free from hydrogenated fats, high fructose corn syrup, and bleached/bromated flour, making it safe for people with a strict diet regimen. <br/> <br/></span><span class=\"a-text-bold\">TASTE THE CALIFORNIA OLIVES AT THE COMFORT OF YOUR HOME</span><span> <br/> <br/>Georgia Olive Farms Chef’s Blend Extra Virgin Olive Oil: Premium olive oil from super high-density olive trees. We source our olives from our own farm in California &amp; process them in our own mill in less than 24 hours! <br/> <br/></span><span class=\"a-text-bold\">MAKE YOUR MEALS MORE SPECIAL</span><span> <br/> <br/>Pasta Noodles, Salmon, Roasted Veggies, Salads, he list can go on how you can make use of our special olive oil. You can also mix this fresh olive oil with balsamic vinegar for a savory bread dipping. Try our EVOO to make your meals special from breakfast through dinner. <br/> <br/></span><span class=\"a-text-bold\">ADD IT TO THE FOOD GIFT BASKET</span><span> <br/> <br/>Surprise the chef or food lover in your love when you add our olive oil to your cooking gifts! Ideal to be a part of gourmet gift baskets, Christmas gift baskets, and food gifts.</span></p> </p>", "price": "29.95", "currency": "$", "product_rating": "4.6", "Color": ["initial", "PT01", "PT02", "PT03", "PT04", "PT05", "PT06"], "availability": true, "shipping": false, "delivery_date": null, "delivery_cost": null, "warranty": false, "warranty_policy": null, "condition": "new", "image": "https://m.media-amazon.com/images/I/31tyEa2rauL._SX300_SY300_QL70_ML2_.jpg", "latest_reviews": [{"reviewer": "Barbara Hock", "rating": "5.0", "review": "This olive oil was a part of a gift basket for my mom who loves this olive oil and uses it for salad dressings. For every day cooking, she uses one that isn't as pricey."}, {"reviewer": "Susan W.", "rating": "5.0", "review": "I first bought this olive oil blend at a craft fair in Carrabelle, Florida.  I immediately wished I had bought more than one bottle.  So smooth with the most delicious buttery flavor.  I am in love with this olive oil blend.  It's the best I have ever tasted.  I was so happy to find it on Amazon and have since bought more bottles and will buy more still.  So good!  You just have to try it."}, {"reviewer": "Louis Consolaro", "rating": "5.0", "review": "This is a great product with a very good taste and it’s from Ga. USA."}, {"reviewer": "Brian Tru", "rating": "4.0", "review": "Overall, the oil is good. In prior purchases, the taste was fresher and more robust. The harvest date on this bottle was Fall 2022. 15 months ago."}, {"reviewer": "Dr Andy", "rating": "5.0", "review": "Superb taste. After this, you'll realize what olive oil should be. Great for any use."}, {"reviewer": "Mary Righton Brown", "rating": "5.0", "review": "It’s very delicious and high quality!"}]}