{"product_url": "https://www.amazon.com/Hammermill-Sustainably-Sourced-American-105500C/dp/B086XKC7SQ/ref=sr_1_6?dib=eyJ2IjoiMSJ9.BGp6pdQoiuBqqYAtiCHQxHiCIbafdgNm2DV3I4srl_teW3CS3SZz0I3Yyfhtjv1XIAT9YStDnOU5-xVffDcp91-t4B3Jcxt183zW_fwOs84pQ6hLKlcIKN3EYtnuiOlD7O3WwdjPwlOL4OX8fbqVFSlv4GFwngWLkbkPIE0TBBNiFFf48Xl5QMxEHAXI8ZIynwNvljcfVcTYdGgCq0iHWq3V2vMCgRCpzTpJyZKqHuy0H2j4B1ynEGRSdZg_PblLnsUqmB-yR8JzyVXNQtN4p1stZ3iZMm9UNgeVI391qvVBznm4vCDPN0zXl2cwhNgVo-exE4g_WSf4zVtJnDwPyLX0mLtKCk2WvTYNae3o5ukYCfBlIA_gwbYw8UfBMyWGBWhgZThJdZt_xzQ8C41eCCMqlczDaJFeQzkm4WlFnyMa02wr6l2LAmYwzDAuIwNE.lTH3gvbcp8HpWUS4qWzca8Z7Hgv0QI5FhY8YDt0qYRA&dib_tag=se&keywords=a4+paper+ream&qid=1734643358&sr=8-6", "product_name": "Hammermill A4 Paper, 20 lb Copy Paper (210mm x 297mm) - 10 Ream (5,000 Sheets) - 92 Bright, Made in the USA, 105500C", "price": "99.99", "currency": "$", "product_rating": "4.7", "Color": ["10 Ream | 5000 Sheets"], "availability": true, "shipping": true, "delivery_date": "Wednesday, January 1", "delivery_cost": "814.10", "warranty": false, "warranty_policy": "Amazon.com Return PolicyAmazon.com Voluntary 30-Day Return Guarantee: You can return many items you have purchased within 30 days following delivery of the item to you. Our Voluntary 30-Day Return Guarantee does not affect your legal right of withdrawal in any way. You can find out more about the exceptions and conditions here.", "condition": "new", "image": "https://m.media-amazon.com/images/I/71r5mmTzeTL.__AC_SX300_SY300_QL70_ML2_.jpg", "latest_reviews": ["Although this is listed as a copy paper, it works perfectly with my HP inkjet printer. The white is super crisp and the colors come through great. The paper itself has a great consistency and has a nice texture that feels nice in the hand. The price is great too!","As the designated person in charge of procurement for our company, I can confidently say that Hammermill 20 lb Copy Paper has become the undisputed paper of choice for all our printing needs. This exceptional product has earned its well-deserved five-star rating for several compelling reasons.First and foremost, the quality of the paper is outstanding. The 20 lb weight strikes the perfect balance, providing substantial thickness for professional printing while remaining versatile enough for a variety of office tasks. Whether we're producing reports, presentations, or everyday documents, the Hammermill copy paper consistently delivers crisp and clear prints, showcasing the high standard of its composition.The brightness of the paper is another standout feature. The 92 brightness rating ensures that our prints exhibit vibrant colors and sharp text, enhancing the overall professional appearance of our documents. The consistent brightness across each sheet reflects the reliability we require for our business communications.Durability is a crucial factor, especially in a high-demand office environment. Hammermill copy paper proves to be resilient, resisting jams and ensuring smooth and reliable printing performance. Its compatibility with a range of printers and copiers further adds to its versatility, allowing us to streamline our printing processes seamlessly.The resealable packaging is a thoughtful touch that we appreciate. It not only keeps the paper fresh and free from dust but also makes storage and accessibility a breeze. The resealable feature aligns with our commitment to sustainability, as it helps minimize unnecessary waste and prolongs the lifespan of the paper.Cost-effectiveness is always a consideration, and Hammermill copy paper excels in this regard. The reasonable pricing, combined with the product's performance, makes it a budget-friendly choice that doesn't compromise on quality.In conclusion, Hammermill 20 lb Copy Paper has become an integral part of our daily operations. Its consistent quality, reliability, and cost-effectiveness make it the only paper we trust for our business printing needs. We confidently award this product a well-deserved five stars, and we look forward to continuing our partnership with Hammermill for all our future printing endeavors.","The quality and price of this paper is exceptional. Having Amazon deliver it is definitely a bonus as a small business owner.","The individual packages were broken inside the box. The paper is fine and still useable.","Better than the generic brands, but you pay for it.","With the inflation, it's really hard to find affordable paper with 100 lumens and this one is really worth it for its price. We do a lot of printing because of school stuffs so we know what a good quality paper is and this one is the top.Only downside is probably with them picking Purolator as the courier, and I'm telling ya, Purolator and FedEx are no good coz they'll say that they have attempted to deliver the package even though they didn't. I know coz I stay home all day to wait for packages and these delivery people from these couriers don't really deliver it, they just want you to pick up at their locations. I would take off a rating for that but the sellers don't deserve it since they are nice too."]

}