{"product_url": "https://www.amazon.com/A4-Premium-Printer-Paper-Available/dp/B076QK6VLN", "product_name": "A4 Premium Printer Paper - Available in Packs of 40,100 or 500 Sheets - Imported from Thailand (40 Sheets)", "description": "High quality moderately bright, white copier papers Consistently smooth papers won't jam in the printer. Double-sided thick paper for added worthiness. Delivers premium quality color and B&W printouts with details and crispness. Extend the duration of photocopy Ideal for copying or printing tasks Certified by TISI Standard. Certified by International Organization for Standardization (ISO 9001:2008) Certified by Environmental Management Certification (ISO 14001:2004) Certified by Occupational health and safety management systems (ISO 18001:2007) Keep away from flame and moisture. Paper Color : White Paper Thickness : 80 gsm, 21-lb weight. Paper Size (Width x Length) : 210 _ 297 mm. (A4) Contains : Return if not 100% Satisfied Package contains 40 sheets.", "price": "8.88", "currency": "$", "product_rating": "4.3", "Color": "White", "availability": true, "shipping": true, "delivery_date": "Wednesday, January 1", "delivery_cost": "119.95", "warranty": false, "warranty_policy": "For warranty information about this product, please click here", "condition": "new", "image": "https://m.media-amazon.com/images/I/711raTk9jpL.__AC_SX300_SY300_QL70_ML2_.jpg", "latest_reviews": [{"reviewTitle": "Great Product, if a bit pricey.", "reviewBody": "The paper was delivered quickly, overnight, which was important because we needed some A4 paper that fast. The product itself is top drawer, to be sure. But the price was really high. Forty pieces of paper for ten bucks is just too much. Yeah, I get it, imported from Thailand, where the labour is cheap, pennies on the dollar compared to America...and the import taxes and all that junk. I suppose the fact that we needed it \"right now\" can be seen as justifying the price for overnight free delivery.\n\nAgain, great product, good print quality (I have a little HP 1020 laser printer) and satisfied with the results.", "rating": 5}, {"reviewTitle": "Excellent paper if you need European A4 size paper.", "reviewBody": "I purchased a certificate for a British Lord as a gag gift for af fiend last Christmas.  After the purchase on Groupon, I had to print out the certificate.  However it would not fit on regular 8.5 x 11 paper.  It turned out that the certificate was set for the European 8 x 11.5 ( I may be slightly off here) as I’m going from memory).  I didn’t like how it looked if I reduced it so I bought this JUST for the certificate.  But I did learn that mot of the world uses this A4 size paper while the US does not.  Well who knew???  Lol", "rating": 5}, {"reviewTitle": "Excellent Quality but Way too Costly", "reviewBody": "Excellent paper if you are searching for A4, but very pricey for such a small amount.  Had to buy because I was in a hurry, but would not pay the price again for such a small amount of paper.", "rating": 5}, {"reviewTitle": "Expensive", "reviewBody": "The paper quality was good. However, the number of sheets were very less and it is highly priced.", "rating": 4}, {"reviewTitle": "As described.", "reviewBody": "Good product and good price. Thanks", "rating": 5}, {"reviewTitle": "fasted expedition", "reviewBody": "Need A4 paper not disponible in Québec", "rating": 5}, {"reviewTitle": "A little too expensive", "reviewBody": "Purchased the product because needed the item in a few days. I do believe I over payed for it.", "rating": 3}, {"reviewTitle": "Affodable", "reviewBody": "Quality is absolutely amazing", "rating": 5}, {"reviewTitle": "These papers are very expensive and scarce", "reviewBody": "These papers are very expensive and scarce", "rating": 1}, {"reviewTitle": "Good quality", "reviewBody": "Quality paper", "rating": 4}]}