{"product_url": "https://www.amazon.com/A4-Premium-Bright-White-Paper/dp/B07VBP4Y74", "product_name": "A4 Premium Bright White Paper – Great for Copy, Printing, Writing | 210 x 297 mm (8.27\" x 11.69\") | 24lb Bond / 60lb Text (90gsm) | 250 Sheets per Pack", "description": "DIMENSIONS – 210 x 297 mm ( 8.27 x 11.69”) A4 is the close equivalent to U.S. letter size (8.5 x 11”)  PREMIUM QUALITY – Made from 24lb (90gsm) premium quality bond paper. Excellent use for art projects, business communications, posters, documents and many more!  DOUBLE-SIDED WHITE SMOOTH FINISH – 98 brightness rating that's perfect for designing eye-catching presentations and making your artsy designs pop. Holds colors well and delivers rich, vibrant colors and sharp images with flawless results.  FULL REAM OF 250 SHEETS – Acid and lignin-free cardstocks that won't make your documents, arts and print works turn yellow and brittle. This preserves the paper, texts, and images and keeps it last long. This paper is also made with SFI wood fibers.  Perfect paper choice for personal, office and school use!", "price": "25.99", "currency": "$", "product_rating": "4.3", "Color": "White", "availability": true, "shipping": true, "delivery_date": "Tuesday, December 31", "delivery_cost": "573.55", "warranty": false, "warranty_policy": "Amazon.com Return PolicyAmazon.com Voluntary 30-Day Return Guarantee: You can return many items you have purchased within 30 days following delivery of the item to you. Our Voluntary 30-Day Return Guarantee does not affect your legal right of withdrawal in any way. You can find out more about the exceptions and conditions here.", "condition": "new", "image": "https://m.media-amazon.com/images/I/51UdahrtjbL.__AC_SX300_SY300_QL70_ML2_.jpg", "latest_reviews": [{"rating": "3.0", "title": "Product Review", "date": "May 13, 2024", "text": "Thank just what I ordered."}, {"rating": "4.0", "title": "GOOD", "date": "November 8, 2023", "text": "The price/efficiency ratio is not very satisfying."}, {"rating": "1.0", "title": "dont waste your time", "date": "February 24, 2021", "text": "this is cardstock. its super thick paper and i dont use it. that wasnt mentioned in the title otherwise i would have not wasted my money"}]}