{"product_url": "https://www.amazon.com/Xerox-A4-100gsm-Premier-Paper/dp/B000NR7P26", "product_name": "Xerox A4 100gsm Premier Paper - White Ream", "description": "Xerox premium paper. High quality paper specially designed to add a premium finish to your letterheads, reports, documents etc. Excellent for high volume printing in laser, inkjet printers and copiers. Weight - 100gsm (grade A). Size - A4.", "price": "7.41", "currency": "$", "product_rating": "4.6", "Color": ["White"], "availability": false, "shipping": false, "delivery_date": "This item cannot be shipped to your selected delivery location. Please choose a different delivery location.", "delivery_cost": null, "warranty": false, "warranty_policy": "Amazon.com Return PolicyAmazon.com Voluntary 30-Day Return Guarantee: You can return many items you have purchased within 30 days following delivery of the item to you. Our Voluntary 30-Day Return Guarantee does not affect your legal right of withdrawal in any way. You can find out more about the exceptions and conditions here.", "condition": "new", "image": "https://m.media-amazon.com/images/I/519WeLzopgL.__AC_SX300_SY300_QL70_ML2_.jpg", "latest_reviews": [{"rating": "5.0", "title": "Quality paper", "review": "Good quality paper."}, {"rating": "4.0", "title": "Not bad, pretty good quality paper", "review": "Quite pleased with this paper. Its reasonable quality in terms of thickness and opacity (although I prefer 120gsm where possible as the \"sweetspot\" of quality paper that's not too thick or card-like). Its got a nice matte, textured finish that (to me) is a lot more sophisticated than the \"shiny\"/gloss finish that some other brands use for their printer paper. This is a full ream (500 sheets) so not bad in terms of value. The only thing I would say is actually the packaging could be improved - while its obviously great that the paper comes wrapped in biodegradable/recyclable paper packaging rather than shrink-wrap plastic (from an environmental perspective) the packaging does tear easily especially with the weight of a full ream inside, and there's no easy way to open the packaging and take some paper out and part-load a printer (few home printers take a full 500sheat ream) while leaving the rest to save for later - the outer paper packaging just tends to rip completely apart once opened and isn't much use for storing the rest of the ream until its needed. The paper packaging also is quite thin and doesn't protect the edges of the paper as effectively during shipping/transit to you, so mine was slightly damaged for a few top sheets due to being \"dented\" by another object during shipping. So 4/5 stars, pretty good but not perfect."}, {"rating": "5.0", "title": "Stationary fetish", "review": "this is lovely paper for nice letters and cvs"}]}