{"product_url": "https://www.amazon.com/Fabriano-789103-Paper-Photocopies-White/dp/B0056250M0", "product_name": "Fabriano 789103 Paper for Photocopies, A4, White Pack of 5 reams", "price": "22.99", "currency": "$", "product_rating": "4.4", "Color": ["white"], "availability": false, "shipping": true, "delivery_date": "Tuesday, Dec 31", "delivery_cost": "6.99", "warranty": false, "warranty_policy": "Amazon.com Return PolicyAmazon.com Voluntary 30-Day Return Guarantee: You can return many items you have purchased within 30 days following delivery of the item to you. Our Voluntary 30-Day Return Guarantee does not affect your legal right of withdrawal in any way. You can find out more about the exceptions and conditions here.", "condition": "new", "image": "https://m.media-amazon.com/images/I/61+A6q8Oj9L.__AC_SX300_SY300_QL70_ML2_.jpg", "latest_reviews": ["Prendo spesso Fabriano in termini di carta, il prezzo questa volta mi ha spinto ad andare su una carta di tipo 1 (giusto per provare). Il prodotto non è male anche se la concorrenza a mio avviso ha superato lo storico brand italiano, sia per la qualità che il prezzo. In sostanza esistono alternative migliori.Questa carta è comunque validissima, adatta ogni esigenza e anche oltre.Unica pecca è la spedizione, le risme vengono consegnate in modo molto approssimativo e blando e quindi la carta ne risente notevolmente durante il tragitto e la spedizione.Sarebbe consigliabile proteggere i pacchi contenente le risme con dei celophan protettivi molto resistenti.Sono comunque rimasto soddisfatto, poi sono passato ad altro marchio.", "La carta Fabriano è di ottima qualità, rimasta immutata nel tempo.Tra la Copy 1 e la Copy 2 non c'è molta differenza (il diverso grado di bianco è ravvisabile solo con un confronto diretto), pertanto dinanzi ad un'offerta considerevolmente più bassa per la seconda, non c'è molto da pensarci.", "Appena ordinata ed è già arrivata perfetta come sempre. Bravi.", "cosi' come visto in altre recensioni, confermo che anche a me e' arrivata la scatola di cartone danneggiata con conseguente danno ad una risma (ho acquistato il pacco da 5) e perdita di un centinaio di fogli che venivano deformati o strappati", "Ottimo prodotto: arrivato in anticipo di  due giorni,  imballo in buone condizioni (scatole integre, chiuse col nastro adesivo); carta favolosa, fra le migliori in commercio, perfetta per stampa laser e e inkjet, anche se ovviamente non è una carta pe stampa fotografica.  Ma per le stampe normali è di qualità superiore, paragonabile alla Navigator. Peccato solo che il costo  non sia proprio economico. Una volta alla METRO la potevi trovare a 2.80 -3.00 euro + iva alla risma, oggi la trovi solo su internet intono ai 4.80-5 euro + iva alla risma. Ma visto che carta di qualità inferiore la trovi a prezzi simili o più alti e che la Navigator non la trovi a meno di 7 euro a risma bisogna accontentarsi..."]}