{"product_url": "https://www.amazon.com/Muir-Glen-Organic-Tomato-Sauce/dp/B000LKXG64", "product_name": "Muir Glen Organic Tomato Sauce, 15 oz. (Pack of 12)", "description": "Add big flavor to your homemade pasta sauce or favorite soup recipe with Muir Glen Organic Tomato Sauce. This tomato sauce is made with vine-sweetened tomatoes for the perfect taste. Muir Glen organic tomatoes are grown in the soil of California and are perfectly pureed and lightly salted to create rich and creamy tomato sauce. USDA Certified Organic, Non-GMO Project Verified and gluten free, Muir Glen Organic Tomato Sauce is the perfect addition to shakshuka, ratatouille, pizza sauce or your favorite sloppy joes. Muir Glen organic tomatoes fresh from the vine are an easy and delicious way to upgrade your favorite recipes. These organic tomatoes are grown in California and are canned quickly for peak freshness.", "price": "45.99", "currency": "$", "product_rating": "4.5", "Color": [], "availability": true, "shipping": false, "delivery_date": null, "delivery_cost": null, "warranty": false, "warranty_policy": null, "condition": "new", "image": "https://m.media-amazon.com/images/I/5144XKEr9SL._SX300_SY300_QL70_ML2_.jpg", "latest_reviews": ["Honestly I love this sauce and use it all of the time.  It is lower in acidity than many others (at least for me) and with a few fresh additions (garlic, onion, pepper flakes etc) its great.  Although its great on its own too!","The order was well packed, but a few cans were severely dented and others just a little dented. This may not bother some people, but it bothers me. The cans were not broke. The sauce itself is my favorite, that’s why I bought it.","I have been making Pasta Fagioli for years and lately I tried using this tomato sauce.  This is the best sauce I have ever used for this recipe.  My husband said it is recommended by chefs.  I can see why.","Whether I'm making pasta, pizza, or whatever, I start with Muir Glen's sauce. The quality is unmatched. I'm grateful to be able to get it in a 12-pack."]}