{"product_url": "https://www.amazon.com/Contadina-Canned-Tomato-Natural-15-Ounce/dp/B078SYZBCW", "product_name": "CONTADINA Canned Tomato Sauce, 12 Pack, 15 oz Can", "description": "The Contadina Roma Style Tomato Sauce contains only the finest and freshest ingredients, with no artificial flavors, colors, or preservatives. Roma tomatoes are peeled, seeded, cooked over low heat to thicken, and concentrate the tomato flavor and color. The canned tomato sauce adds a rich flavor to your soups, stews, meatballs, pasta sauces, and favorite Italian dishes! Since 1918, Contadina has been on a mission to perfect canned tomatoes. It’s that pursuit that led Contadina’s founding family to move their little company across the country to find better soil and a better tomato climate.", "price": null, "currency": null, "product_rating": 4.7, "Color": [], "availability": false, "shipping": false, "delivery_date": null, "delivery_cost": null, "warranty": false, "warranty_policy": null, "condition": "new", "image": "https://m.media-amazon.com/images/I/51gk1P%2BTejL._SX300_SY300_QL70_ML2_.jpg", "latest_reviews": ["THIS SAUCE ID LIKE MOTHER'S HOMEMADE. GREAT TEXTURE. COLOR AND NICE VALE","Came timely, just as described, no dented cans.  I'm completely satisfied.","Contadina is a brand you can count on for all you canned tomato products. It's always competitively priced and often discounted even further.\n\nYou can expect to see the Contadina nane in my pantry from tomato paste to diced, to peeled whole tomatoes.","Great for my chili and spagetti","Could not find it at Sam's Club....","Got what i wanted...","These were a reasonable price, tasted good & lasted a long time. I gave 4 stars because almost every can was dented, some more than others.","Thick and hearty tomato sauce for any dish.  Repeat buyer.","Good Flavor and High Quality","...Despite the convenience and satisfactory quality of the product, I cannot recommend purchasing this item from the seller I obtained it from....","The product is excellent and for a better price than in stores. It’s convenient for me when I use can after can of the sauce.","value for money, taste very good. easy to use . work well in any recipe,that calls for tomato sauce. will buy again. .a gill","We use this so often, I like to keep it on hand. Easy transaction.","Good sauce but expect dented cans. Delivery condition is a toss up. Box open with 4 of 12 cans dented."]}