{"product_url": "https://www.amazon.com/Nomato-Sauce-Original-Tomato-Marinara/dp/B07GPXD7NN/ref=zg_bs_g_6465030011_d_sccl_50/130-0780116-4726006?psc=1", "product_name": "Nomato by Norine - 1 Pack of Original Tomato Free Marinara Sauce (24 oz) - Tomato Free, Gluten Free, Nut Free and Dairy Free (Marinara, 1 Pack)", "description": "Tomato-Free Goodness: Enjoy the rich flavor of marinara ketchup without tomatoes. Our Nomato Original is crafted from a unique blend of celery, carrots, lemon, beets, onion, garlic, and basil.  Allergen-Friendly: Catering to various dietary needs, this tomato-free marinara ketchup is dairy-free, gluten-free, and nut-free. It's a versatile condiment that accommodates different dietary preferences.  Root Vegetable Magic: Savor the delicious taste of ketchup made with root vegetables. Experience a burst of flavors that adds depth to your favorite dishes.  Versatile Culinary Companion: Elevate your culinary creations! Use Nomato Original for pizzas, soups, chili, stews, pasta, beans, meatballs, and meatloafs. Its diverse applications make it an essential pantry item.  Healthy Twist: With the goodness of nutrient-packed root vegetables, Nomato Original Tomato-Free Marinara Ketchup is a healthy alternative, bringing both taste and nutrition to your table.", "price": "24.99", "currency": "$", "product_rating": "4.2", "Color": ["initial", "PT01", "PT02", "PT03", "PT04", "PT05", "PT06"], "availability": false, "shipping": false, "delivery_date": null, "delivery_cost": null, "warranty": false, "warranty_policy": null, "condition": "new", "image": "https://m.media-amazon.com/images/I/415fdrkkwEL._SY300_SX300_QL70_ML2_.jpg", "latest_reviews": ["Pricey, but great alternative! My husband has IBS &amp; tomatoes are terrible for him...but giving up pasta dishes is so hard with kids who love it...enter: Nomato! It was tasty - kid &amp; dad approved. ;) Some reviewers have mentioned it being runny, maybe a little, but definitely holds enough consistency for recipes. So relieved to have found an option that doesn't upset his stomach and tastes good!", "Tastes Just like Tomato Sauce I recently became aware that I am sensitive to nightshades, gluten and dairy.  To say I love tomatoes is an understatement. I learned from my nutrition instructor about Nomato Sauce.  I was a bit skeptical that  carrots and beets could taste just like tomato sauce. The sauce tastes exactly like the most delicious tomato sauce. I hope that the word gets around and that you can distribute it to stores like Whole Foods and Trader Joe's.", "I wasn't sure about the taste, but not bad. 4 stars because of the price and the liquid separating makes me wonder if it would actually stick to noodles. However, it actually tastes good! I food prepped with it so I'll have to try to update how it does when you freeze it and thaw it.", "Great Alternative to Spaghetti Sauce, but It is very bland.", "Basically just juice I really wanted to like this as I can’t eat nightshades. The price scared me but I don’t mind paying for quality items from small businesses so I got a jar."]}