{"product_url": "https://www.amazon.com/Pomi-Tomatoes-Tomato-Sauce-12-17-64/dp/B07DLKM4DZ", "product_name": "Pomì Tomato Sauce - Creamy, Velvety Italian Sauce with a Touch of Salt, No Additives or Preservatives - Made from 100% Fresh Italian Tomatoes - 17.64oz BPA-Free Carton (Pack of 12)", "description": "AUTHENTIC ITALIAN FLAVOR: Made in Italy from 100% freshly picked and sun-ripened tomatoes, Pomì Tomato Sauce brings rich, vibrant Italian taste straight to your kitchen. Perfect for pizza, pasta, and more—ideal for clean eating enthusiasts.  PURE & SIMPLE INGREDIENTS: Crafted with only fresh Italian tomatoes and a hint of salt, our sauce contains no preservatives, additives, or GMOs. Enjoy a wholesome product with every meal, perfect for those who prioritize clean, real food.  DIET-READY MEAL & NUTRIENT-RICH: This gluten-free, BPA-free sauce is low in sodium and sugar, making it suitable for keto, paleo, and low-carb diets. Experience rich flavor without extra calories or carbs—great for health-conscious individuals.  VERSATILE & READY TO USE: Ideal for pizzas, classic pasta dishes, soups, and more, Pomì Tomato Sauce is ready to use straight from the carton. Save time while adding an authentic Italian touch to your meals, perfect for easy meal prep.  CONVENIENT PACKAGING: Available in a pack of 12 (17.64oz BPA-free cartons), Pomì ensures you're always stocked with fresh tomato sauce. The BPA-free cartons maintain freshness and quality, providing you with delicious sauce every time.", "price": null, "currency": "$", "product_rating": 4.7, "Color": ["initial", "PT01", "PT02", "PT03", "PT04", "PT05", "PT06"], "availability": false, "shipping": false, "delivery_date": null, "delivery_cost": null, "warranty": false, "warranty_policy": null, "condition": "new", "image": "https://m.media-amazon.com/images/I/41fuDtQ2jmL._SX300_SY300_QL70_ML2_.jpg", "latest_reviews": ["Healthy, delicious and super convenient!", "Best tomato sauce", "what's not to like?", "Must have in the house!", "Good quality and great taste", "Taste", "Excellent Product", "Just tomato’s"]}