{"product_url": "https://www.amazon.com/Phomemo-Paper-White-Quick-Dry-Multipurpose-Compatible/dp/B0CR1MLKDV", "product_name": "Phomemo A4 Thermal Paper-White Quick-Dry Printer Paper, Multipurpose A4 Thermal Paper Compatible for Phomemo M08F, M832, M833 Portable Thermal Printer, 8.27\"x11.69\"(210mm*297mm), 200 Sheets", "price": "27.99", "currency": "$", "product_rating": "4.8", "Color": ["White"], "availability": true, "shipping": true, "delivery_date": "Thursday, December 26", "delivery_cost": "174.67", "warranty": false, "warranty_policy": "For warranty information about this product, please click here", "condition": "new", "image": "https://m.media-amazon.com/images/I/51ZFjGQwEwL.__AC_SX300_SY300_QL70_ML2_.jpg", "latest_reviews": [{"reviewTitle": "Works Great with my Thermal Printer", "reviewBody": "Nice quality and a nice long “shelf life” for printed docs. It works great with my thermal printer.", "rating": 5, "verifiedPurchase": true}, {"reviewTitle": "Works like needed", "reviewBody": "Works great in my portable printer.", "rating": 5, "verifiedPurchase": true, "vineReview": true}, {"reviewTitle": "Quality paper", "reviewBody": "This is great paper for your thermal printer, if you're looking for paper for regular printing or only occasional printing.I like that it comes as single sheets, as I don't use my thermal printer often, yet want an end product that doesn't curl itself into a tube like you get with rolled paper, and that I don't have to deal with a stack of continuous feed paper. I can just pop a single sheet in the back, and I'm done! A bonus feature, that I really, really like, is the back of the sheets have a faint watermark letting you know that it's the 'wrong side to print on', as sometimes due to lighting, I can't always 'feel' or see which side is right. Win/win! 5 stars!", "rating": 5, "verifiedPurchase": true, "vineReview": true}, {"reviewTitle": "Great refill pack", "reviewBody": "I quickly breezed through my sample back of paper that came with my phomemo printer, so I ended up buying this. These are the exact same pages that came with the printer so the quality is just as good as what is to be expected.", "rating": 5, "verifiedPurchase": true, "vineReview": true}, {"reviewTitle": ". A reliable choice for all your thermal printing needs.", "reviewBody": ". It delivers crisp, clear prints every time and is compatible with a wide range of thermal printers. The paper is high-quality and durable, ensuring long-lasting legibility.", "rating": 5, "verifiedPurchase": true, "vineReview": true}, {"reviewTitle": "the print is good, but...", "reviewBody": "The print quality is nice. There is no smearing, or issues with it gliding through my thermal printer. The sheets are extra bright white which make for good contrast. I will say however that my only cons are that the sheets are thin, and each sheet also has \"This side not printing side\" printed on the back of each one.... Think i would prefer just a symbol, even if it were just their company logo... But I'm nitpicking at that point.", "rating": 3, "verifiedPurchase": true, "vineReview": true}, {"reviewTitle": "Perfect for Phomemo portable printer", "reviewBody": "I purchased this because I have the corresponding portable printer.  I also purchased this because of the size of paper, 8.5 x 11 inches so I can print on the go.  The quality of the paper is impeccable considering it is thermal paper.  It's quite good quality and probably as close as you'll get to regular copy paper.  This comes with 200 sheets so it will last a good while.  The pricepoint for this pack is excellent.  Overall I highly recommend this pack if you have a Phomemo printer!", "rating": 5, "verifiedPurchase": true, "vineReview": true}, {"reviewTitle": "These work perfectly", "reviewBody": "I have used these quite a few times and find them to work very well. I really like that they don't smear easily. I feel good about using them since they are BPA free.", "rating": 5, "verifiedPurchase": true, "vineReview": true}, {"reviewTitle": "Standard ISO 216 A4 size sheets. The bigger pack saves money per print.", "reviewBody": "The only important thing to know is the thermal paper is top quality and compatible with any portable thermal printer that supports 8.3 x 11.7 inch page size. Will not deteriorate if properly stored.My Phomemo printer is reliable. Yes, thermal paper costs a little more but nothing compared to wasted inkjet cartridges and the frustration inkjets inevitably bring. The 200 sheet box is good value.", "rating": 5, "verifiedPurchase": true, "vineReview": true}, {"reviewTitle": "If you need thermal paper, this is a solid choice.", "reviewBody": "I recently tried Phomemo Thermal Paper, and it's made a big difference in my printing. It's A4 size, which fits most portable printers, so no compatibility worries. The paper quality is excellent - sharp prints without smudges or lines. It comes well-packaged to protect against moisture, and it stays in good condition if stored right. It's a bit pricier upfront than ink cartridges, but it saves money in the long run and is much more convenient. Overall, I'm really happy with it. Great for personal or professional use.", "rating": 5, "verifiedPurchase": true, "vineReview": true}]}