{"product_url": "https://www.amazon.com/Mutti-Tomato-Pasta-Bottiglia-14/dp/B010C7JD3U", "product_name": "Mutti Tomato Puree (Passata), 14 oz. | 1 Pack | Italy’s #1 Brand of Tomatoes | Fresh Taste for Cooking | Canned Tomatoes | Vegan Friendly & Gluten Free | No Additives or Preservatives", "description": "Mutti sun-ripened tomatoes are transformed into a sweet velvety puree with a touch of Mediterranean sea salt. After eliminating the skin and seeds, the tomatoes are pureed to achieve a smooth, luxurious texture while maintaining their bright red color and sweet flavor.  These pureed tomatoes are the highest quality with no GMOs, additives, or preservatives. Bring delicious, fresh flavor into your kitchen with non-BPA packaging.  These glass bottled tomatoes are the best-kept secret in every recipe from a fast tomato soup, marinara sauce, and even a Bloody Mary. Perfect for those passionate about cooking and desire great taste.  Mutti Tomato Puree is a vegan and gluten-free food. Made with natural goodness, you can see and taste a difference in these delicious, canned tomatoes.  From Italy’s #1 tomato brand. Since 1899, the Mutti family has shared its passion for Italian tomatoes and preserving one of nature’s perfect gifts at the peak of ripeness. Mutti has partnered with WWF in Italy for over 20 years to reduce water consumption and its carbon footprint.", "price": null, "currency": null, "product_rating": 4.3, "Color": ["Tomato", "Basil"], "availability": true, "shipping": false, "delivery_date": null, "delivery_cost": null, "warranty": false, "warranty_policy": null, "condition": "new", "image": "https://m.media-amazon.com/images/I/41qGdkWHErS._SX300_SY300_QL70_ML2_.jpg", "latest_reviews": ["Good product. Best tasting. Highest quality", "I think the price on this was fine. The Taste is fabulous it's excellent to add a little to some canned tomatoes to give it a little bit more sweetness and freshness if you want to whip up some quick homemade sauce if you're out of it but happen to have a can of diced or stewed tomatoes. A little bit seems to go a long way as it's very flavorful. I would recommend this product highly.", "First of all, I love this passata. It’s the base of all my red sauces and everyone loves the flavor. It’s not sweet or salty but just right. The flavor of the Italian tomatoes stands out and I am never disappointed at the taste.Sadly, the shipping is an issue. The first 6 I bought came individually bubble wrapped and placed in a box where the bottles sit 3 on top of 3 with additional bubble wrapping on the corners.  All 6 survived. The next shipment of 6 arrived today.  In a huge Amazon box with a smaller box inside where each bottle was wrapped like before and 5 sit nicely in the smaller box with one on top of the five.  That last one was not just broken, it was crushed. Thankfully the bubble wrapped kept all but a few drops of spilling out, but you can tell that one bottle must have been constantly smashing against the other bottles until all the glass inside was smaller than the lid itself.The quality of the purée is enough for me to buy again. My odds so far is 11/12 arrive intact anything less would make me think twice."]}