{"product_url": "https://www.amazon.com/Paper-A4-Portable-Quick-Dry-Compatible/dp/B0CRL6YDX8/ref=sr_1_30?dib=eyJ2IjoiMSJ9.Fupb2pj1I9ipTOWon3nh-zWysUdGcCAlY1OI5wvgipKD0FSJkSy6kZ44zritnd6VkExrXI2kpICVBfQPmylQW-McqtS2jn8-sU32l4Wj9sncuOl91ZmGOnuTTsTwdh9h6GvE0bJllBJ4yr0GWb3GYrRaTQzaFI6sFcQDEvaOTSBu0EhdGoHf_jH65C6YqsBn3DcHvXrxM_SlltKIkbCt7tweWYNO8406keD8ITuSczzItf1NpLiscJODNtXoSqhRXavg1ob36eEl16_5bVM8c2DXYZAtt0pmoxkuHIdmDssxsoXK_LetymhEXTSE4C1UF0IFkHPkqZfOxyA2B79-qkfRsjzj39zPdz7sDK7i7cYB1Bm-d5Ikv1Xz5EQUllufy6WCGxBNWDkyGzHAseT_RxQIIswJKbE7swEOxjYaGO7VG6VQTdipbnF4_lJZyTU8.mnzsD3pIEUFoIOkGZqOroh29JLChuvBtAODuxeWX-xk&dib_tag=se&keywords=a4+size+paper&qid=1734290983&sr=8-30", "product_name": "Thermal Paper A4, Thermal Printer Paper for A4 Portable Printer, Advanced Thermal Printing Quick-Dry,Compatible with Phomemo M08F, M832, M833, with Brother A4 Portable Printer, 200 Sheets", "price": "27.99", "currency": "$", "product_rating": "4.5", "Color": ["White"], "availability": true, "shipping": true, "delivery_date": "Thursday, December 26", "delivery_cost": "117.10", "warranty": false, "warranty_policy": "For warranty information about this product, please click here", "condition": "new", "image": "https://m.media-amazon.com/images/I/61F-cnsHwIL.__AC_SX300_SY300_QL70_ML2_.jpg", "latest_reviews": ["Works with my phemo thermal printer. I do like the quality of the paper. It is thinner than traditional computer paper. So it's good for like, maybe on the go. Would I use this consistently for every single project? I have no, it doesn't jam on the thermal paper. It kinda takes a little bit of experience to like. Make sure it's a line perfectly so you won't print sort of sideways? The size fits on my printer. And I think it is affordable, considering that you're not wasting money on ink for the thermal printer itself So I do think it is functional. In that aspect because it is portable paper that you can like print in a car or on the go other than that, I don't see it for everyday life to be honest, and that has allowed to do with the quality of thermal printer that you print.", "Works great and looks great in the thermal printer and even long after you print. Excellent quality paper.", "The paper is thin but prints well. The price seems high for paper but I think that’s normal for thermal paper. You do get a lot of sheets for the price and it does the trick so no complaints.", "I recently purchased the Thermal Printer Paper for my A4 portable printer, and I must say, it has been a game-changer for my printing needs. These A4 thermal paper rolls are perfect for quick-dry printing, allowing me to produce high-quality prints in no time.One of the things I love about this thermal paper is its compatibility with my M08F, M832, and M833 portable printers. I no longer have to worry about finding the right paper size or format for my printer – these rolls fit perfectly and produce excellent results every time.The advance thermal printing technology ensures that my prints are clear, crisp, and smudge-free. I never have to deal with messy prints or ink smudges again, thanks to this thermal paper.With two rolls included in the pack, I always have plenty of paper on hand for all my printing needs. Whether I'm printing documents, photos, or labels, this thermal paper gets the job done quickly and efficiently.Overall, I am extremely satisfied with the Thermal Printer Paper. It's reliable, affordable, and produces professional-quality prints every time. I would highly recommend it to anyone in need of thermal paper for their A4 portable printer.", "This is the first thermal printer paper I have bought for my printer. So far I'm pretty impressed by it. The print is crisp and clear and I have not experienced any spooling like another reviewer. I don't use my printer much so the little extra the paper costs is not that big of an issue. Being that this was my first rolls I don't really have anything to compare it to so can't say that this is the best paper out there.", "The print quality on this thermal paper is the same as the paper I got with my printer, made for the M832 printer.As far as the print quality goes, it's fairly good but keep in mind you only get Black print out of thermal printers.There is one issue I personally have with rolls as well, The start of the roll is fine but the closer you get to the end, the more that the paper wants to roll up on it's own, so you have to work it to stop it from curling in on itself, If you have space, I'd recommend looking at the sheets of thermal printer that's offered, rather than these rolls.", "The paper works perfectly in my M832 wireless printer. It comes in a roll so the paper is curled when it comes out but does flatten out pretty quickly. There’s two rolls in the box, which is great. No issues with it feeding through and the quality is good. It compares equally to the original paper that came with my printer. The size is good for documents and photos, taking note that it’s smaller than a standard sheet. No issues tearing off completed pages with the serrated edge of my printer. This is good thermal paper and would recommend it."]}