{"product_url": "https://www.amazon.com/Del-Monte-Canned-Tomato-Sauce/dp/B0B7ZT4GC6", "product_name": "Del Monte Canned Tomato Sauce, 8 oz (Pack of 24 Cans)", "description": "Del Monte Canned Tomato Sauce, 8 oz, Pack of 24, contains only the finest ingredients, packed at the peak of freshness. This canned tomato sauce is made from the best vine-ripened tomatoes and is easy to store in any pantry making it ready to create a savory, aromatic sauce that tastes just like home in minutes. This savory tomato sauce is ready to add rich flavor to your soups, stews, meatballs, pasta sauces, and favorite family dishes. At Del Monte, we're passionate about cultivating quality vegetables, fruits, and tomatoes. We grow with care on farms, many of which have been with us for generations, and preserve the wholesome goodness you'd expect from your own backyard garden. When you have Del Monte in your pantry, you have wholesome fruits and vegetables at your fingertips. Add some goodness to your table for delicious & nutritious meals that your whole family will enjoy.", "price": null, "currency": null, "product_rating": 4.6, "Color": [], "availability": false, "shipping": false, "delivery_date": null, "delivery_cost": null, "warranty": false, "warranty_policy": null, "condition": "new", "image": "https://m.media-amazon.com/images/I/41kCo6bhz4L._SX300_SY300_QL70_ML2_.jpg", "latest_reviews": ["This is the best of this type of tomato sauce - closest match to those expensive, Italian imports. Cans arrived in excellent condition.", "Great merchandise", "What can I say bad about this? Nothing", "So happy I am able to buy this here!! I only use Del Monte for my Italian gravy. Only two stores where I lived sold it. I recently moved to another state and NO ONE sells it!! So thank you!!", "I use this for my stuffed cabbage and my sauce for spaghetti and meatballs or whenever a recipe calls for tomato sauce.", "Great tomatoes sauce thick and rich.", "Good product that tastes good. Some of the cans had dents, but I am beginning to expect this from Amazon. The only disappointment.", "very good and use it for many recipes.", "This sauce makes everything taste good.", "I didnt like the fact most cans were dented and a little rusted but ive had worse. Ill still order them again for the price that are."]}