{"product_url": "https://www.amazon.com/HP-Printer-Paper-Office20-112090C/dp/B01FIK0PXI", "product_name": "HP Printer Paper | 8.5 x 11 Paper | Office 20 lb | 3 Ream Case - 1500 Sheets | 92 Bright | Made in USA - FSC Certified | 112090C, White", "price": "34.99", "currency": "$", "product_rating": "4.8", "Color": ["White"], "availability": true, "shipping": true, "delivery_date": "Tuesday, December 31", "delivery_cost": "334.58", "warranty": false, "warranty_policy": "Amazon.com Return PolicyAmazon.com Voluntary 30-Day Return Guarantee: You can return many items you have purchased within 30 days following delivery of the item to you. Our Voluntary 30-Day Return Guarantee does not affect your legal right of withdrawal in any way. You can find out more about the exceptions and conditions here.", "condition": "new", "image": "https://m.media-amazon.com/images/I/71Ui3dxCZ9L.__AC_SX300_SY300_QL70_ML2_.jpg", "latest_reviews": [{"reviewTitle": "Love HP", "reviewBody": "Good quality paper, never had to ever return HP paper. Nice sharp color white paper. Easy to write on, never have had a paper jam with this paper, decent price.", "rating": 5, "reviewDate": "November 16, 2024"}, {"reviewTitle": "Great product", "reviewBody": "I liked the paper thickness, value of paper, size is perfect and doesn’t bleed through the paper.", "rating": 5, "reviewDate": "October 26, 2024"}, {"reviewTitle": "Great for office work", "reviewBody": "I use this paper every single day for my work as a notary and immigration preparer, and it’s the only one I trust! It’s consistently high-quality—no jams, crisp prints, and professional-looking documents every time. The 20 lb weight is just right for everyday use, and the 92 brightness makes everything look sharp and clean. Plus, with 1500 sheets in a pack, it lasts a good while. Highly recommend for anyone who needs reliable paper for heavy-duty office tasks!", "rating": 5, "reviewDate": "November 23, 2024"}, {"reviewTitle": "Arrived early, intact, honestly... Perfect! Without a single bend or scratch.", "reviewBody": "I truly don't understand how it's even possible for those with low star ratings/reviews can even claim their paper came crumbled..?! How is that even possible, with the extent in which this supplier strives to ensure their product is protected..? I mean, come in -the packaging they send this paper in is honestly the most reinforced, durable cardboard I've ever seen something shipped in in my life... And not only that, they take additional measurements to pack that already sturdy, tightly fitted package and put it in ANOTHER study box that is snug to a point where the paper inside has no room to really even move around amidst transit... &amp; Thus, I seriously don't understand how it's even possible for anyone to recieve a damaged product?? 💀🤣 Unless someone's fist fighting with their Amazon order from the time it leaves the factory, to the point it arrives on their porch??<br/><br/>Anyway... I really appreciate the sooner -than expected arrival 😊 especially since it was already only going to take 4 days to get here, it's always a treat the rare times prime gets here even earlier than how quickly they already fill orders!<br/><br/>I strongly advise for you to buy the HP paper , over the Amazon basics, which is reccomended alongside this product, &amp; might be the ultimate purchase decision, for someone that doesn't slow down &amp; realize.. The name Brand product is LITERALLY only CENTS more, for premium, higher quality product...<br/><br/>Reviews are the driving point behind why so many of us are inclined to make our purchases, or opt for a product over another... And frugal nuts like me can accidentally be swift to get the \"bargain\" item without considering the name Brand as thoroughly, especially when most of the time it truly isn't this close in cost to get that higher tier item... I promise, you won't regret opting for this product - it's not thin , its surprisingly durable for standard printer / copy paper, it's GREAT for laser printers and prints much higher quality documents, that other generic branded paper I've tested out &amp; compared... Oh, and it's nice that the paper is unexpected BRIGHT white, especially since it's not specially labeled to be brighter than standard.<br/><br/>Seriously, this product is nice, and don't listen to anyone that might make you worry your product will arrived damaged.. remarkable quality in all regards with this supplier on this end :) will be a return consumer from this point on!", "rating": 5, "reviewDate": "May 26, 2022"}, {"reviewTitle": "Quality paper", "reviewBody": "I'm an elementary school teacher and copy paper is essential. This brand is of good quality and serves it's purpose. I just need the price to stay consistent.", "rating": 5, "reviewDate": "November 12, 2024"}, {"reviewTitle": "Good pick", "reviewBody": "Good choice , good product and priced right", "rating": 4, "reviewDate": "September 29, 2024"}, {"reviewTitle": "Decent copy, inexpensive", "reviewBody": "Great for printer", "rating": 5, "reviewDate": "November 19, 2024"}, {"reviewTitle": "Printer paper", "reviewBody": "It's plain printer paper. Good value fir the money. Paper weight is good.", "rating": 5, "reviewDate": "November 4, 2024"}]}