{"product_url": "https://www.amazon.com/Image-White-Multi-Purpose-Paper-80Gsm/dp/B004W6KECM", "product_name": "IMAGE Volume A4 White Multi-Purpose Paper 80Gsm - 1 Box - 5 Reams of 500 Sheets - 2,500 Sheets", "price": "25.70", "currency": "$", "product_rating": "4.3", "Color": ["White"], "availability": false, "shipping": false, "delivery_date": "This item cannot be shipped to your selected delivery location. Please choose a different delivery location.", "delivery_cost": null, "warranty": false, "warranty_policy": "Amazon.com Return PolicyAmazon.com Voluntary 30-Day Return Guarantee: You can return many items you have purchased within 30 days following delivery of the item to you. Our Voluntary 30-Day Return Guarantee does not affect your legal right of withdrawal in any way. You can find out more about the exceptions and conditions here.", "condition": "new", "image": "https://m.media-amazon.com/images/I/61moi7rHTXL.__AC_SY300_SX300_QL70_ML2_.jpg", "latest_reviews": ["Arrivée dans les tempsLivraison arrivée dans les délais, juste un petit défaut sur le carton d'emballage du certainement a un choc au sein du camion du transporteur mais aucune feuille dégradé.Ramette qui font le travail...", "Does what it says on the boxNot much to say but it's white A4 paper that does the job and good job it's delivered as weighs a ton!", "Gute Qualität für einen angemessenen Preis.Die Vielseitigkeit des Universalkopierpapiers zeigt sich besonders bei verschiedenen Anwendungen. Es eignet sich nicht nur hervorragend für den täglichen Bürogebrauch, sondern auch für den Druck von Präsentationen, Berichten oder anderen geschäftlichen Dokumenten.<br/><br/>Die Formatierung des Papiers ist standardmäßig A4, was die Kompatibilität mit den meisten Druckern und Kopierern gewährleistet. Das Papier lässt sich mühelos in verschiedene Druck- und Kopiergeräte einlegen, ohne dabei Probleme zu verursachen.<br/><br/>Die Weiße des Papiers ist ausgewogen und verleiht Dokumenten eine klare und professionelle Optik. Sowohl Schwarz-Weiß- als auch Farbdrucke kommen gut zur Geltung, und der Kontrast ist ansprechend.<br/><br/>Die Papierqualität ist ausgezeichnet. Mit einem Gewicht von 80g/m² ist das Papier robust genug, um den Anforderungen verschiedener Druck- und Kopieraufgaben gerecht zu werden. Es fühlt sich angenehm griffig an und hat eine glatte Oberfläche, die für gestochen scharfe Ausdrucke sorgt.<br/>", "kwalitatief goed papiergoed stevig papier  en voldoet waarvoor het wordt ingezet. Rolt probleemloos uit de printer.Goede aankoop, een aanrader!", "Buen productoBuena calidad, merece la pena."]}