{"product_url": "https://www.amazon.com/Prego-Pasta-Sauce-Sugar-Traditional/dp/B07DFRQLNQ/ref=zg_bs_g_6465030011_d_sccl_9/130-0780116-4726006?psc=1", "product_name": "Prego Traditional No Sugar Added Pasta Sauce, 23.5 Oz Jar", "description": "Be the hero at dinner with Prego Traditional No Sugar Added Pasta Sauce. Versatile and delicious, this classic red sauce features the rich, sweet taste of vine-ripened tomatoes balanced with flavorful herbs and seasonings, with no sugar added (1). This pasta sauce has a taste everyone loves and a thick texture that doesn’t water out, making it a perfect pairing with any pasta. Prego pasta sauce is gluten free, vegan and made without artificial colors or added MSG for a spaghetti sauce you can feel good about. Top off any pasta with this Prego Italian sauce for a quick, family-pleasing meal, or use it as a base for your favorite recipes. The tomato sauce jar top is easy to close and store in the refrigerator for leftovers. Give your family the taste everyone loves with Prego sauces. In addition to Traditional No Sugar Added Pasta Sauce, Prego offers a variety of favorites, including Chunky Tomato, Garlic and Onion Italian, Low FODMAP and more! (1) Not a calorie reduced food. See nutrition facts panel for sugar and calorie content", "price": "2.48", "currency": "$", "product_rating": "4.6", "Color": [], "availability": true, "shipping": false, "delivery_date": null, "delivery_cost": null, "warranty": false, "warranty_policy": null, "condition": "new", "image": "https://m.media-amazon.com/images/I/41t8PN4cYmL._SX300_SY300_QL70_ML2_.jpg", "latest_reviews": ["This didn’t taste sugar free. Very good taste. Great value and texture.", "As far as sugar free sauces this one's one a our favorites ,nice sized,great quality, great value for your money tastes really yummy low salt few ingredients really good 👍 😋", "Tastes great, and so different from the other Prego varieties that it makes you realize how much sugar the other varieties must have.  Also, how unnecessary all that added sugar is.", "Very good and full flavor.", "This was a really helpful product when I was trying to watch my sugar intake in my diet, didn’t know this type of product even existed so I appreciated finding it and using it!"]}