{"product_url": "https://www.amazon.com/Mohawk-Paper-Reams-Sheets-A428C/dp/B077CW5CQK", "product_name": "Mohawk 28 lb. A4 Size Paper, Case Pack of 5 Reams, 500 Sheets per Ream, White (A428C)", "description": "Mohawk multi-purpose A4 sized paper is the perfect solution for when you need to print something out in the European standard size. This high quality paper is ideal for the daily printing of A4 sized documents, reports, faxes, forms, flyers, manuals and all other needs of this size. The Mohawk brand is produced acid-free for archival quality, best performance and longevity. This paper is made from 28 lb. Paper stock with a brightness of 98 and high opacity so that ink doesn't show through to the other side. Paper is made to run through any printer, fax machine or offset press. Each case comes with 5 reams, with each ream containing 500 sheets each.", "price": "200.00", "currency": "$", "product_rating": "5.0", "Color": ["White"], "availability": false, "shipping": false, "delivery_date": "This item cannot be shipped to your selected delivery location. Please choose a different delivery location.", "delivery_cost": null, "warranty": false, "warranty_policy": "Amazon.com Return PolicyAmazon.com Voluntary 30-Day Return Guarantee: You can return many items you have purchased within 30 days following delivery of the item to you. Our Voluntary 30-Day Return Guarantee does not affect your legal right of withdrawal in any way. You can find out more about the exceptions and conditions here.", "condition": "new", "image": "https://m.media-amazon.com/images/I/61cDjCbOD0L.__AC_SX300_SY300_QL70_ML2_.jpg", "latest_reviews": [{"reviewTitle": "Exactly what I wanted", "reviewBody": "This is fabulous paper, I use it to make my traveler's notebook inserts. It's very smooth for writing and a good thickness which keeps most pens (even Papermate flairs) from bleeding with minimal shadowing. I like this size because it's fewer cuts for a cahier size and no cuts for an A5.", "rating": 5, "reviewDate": "August 7, 2018"}]}