{"product_url": "https://www.amazon.com/RAOS-Arrabbiata-Pasta-Sauce-32/dp/B07FK8BRB1", "product_name": "Rao's Homemade Arrabbiata Sauce, 32 oz, Tomato Sauce, All Purpose, Keto Friendly Pasta Sauce, Premium Quality Tomatoes from Italy & Crushed Red Pepper", "description": "Rao’s Homemade Arrabbiata Sauce is another typical Southern Italian sauce originating from the Campania region. Arrabbiata or “Angry” sauce refers to the flavor profile of this sauce made with the perfect amount of crushed red pepper to add a subtle yet spicy flavor to your favorite recipes. Rao’s Arrabbiata Sauce is made with Italian tomatoes, pure olive oil, fresh onions, salt, fresh garlic, fresh basil, crushed red pepper, black pepper, oregano.", "price": null, "currency": null, "product_rating": 4.8, "Color": ["initial", "PT01", "PT02", "PT03", "PT04", "PT05"], "availability": true, "shipping": false, "delivery_date": null, "delivery_cost": null, "warranty": false, "warranty_policy": null, "condition": "new", "image": "https://m.media-amazon.com/images/I/41dTsPnPfgL._SX300_SY300_QL70_ML2_.jpg", "latest_reviews": ["As far as a store-bought sauce is concerned, it's the best I've tried, and I've tried a number of brands. I like the fact that it has a little kick to it.One thing to seriously keep in mind when you purchase a sauce, or other canned\/jarred foods is to stay away from any that include seed oils. They are finding out that seed oils are worse for you than sugar. Although this sauce is not organic, it does contain olive oil. Main reason why I purchased it.For a store-bought sauce, I highly recommend it.", "Best spaghetti sauce in the whole world I would recommend it if you have taste buds you will love this sauce!", "I ordered the Rao's sauce a few months back, as I was going through a phase of trying different pasta sauces. The Rao's sauce came as a shocker, as it wasn't a bland sauce, like most jarred sauces.The Rao's sauce must be getting popular, as I've had it on order for close to 2 months.Not a Rao's issue, however Amazon needs better packaging. 2 jars in bubble wrap bags inside of a box large enough to contain 6, is a recipe for breakage.Again, the sauce is great. I've got 4 jars that appear on constant back order. Maybe next month? Follow up on the latest delivery. The package was destroyed in transit.  Sauce is in short supply due to inept delivery packaging.", "Love it.", "I like all the RAO products. This sauce is delicious! It has a bit of heat. It’s perfect for dishes that need more spice.", "Delicious! Nice slight heat. No sugar added. Fresh tomato flavor.", "We had heard a lot about this sauce and wanted to try it.  It is amazing compared to other sauces.", "I use this for sauce space and add onions, garlic, more hot peppers, etc."]}