{"product_url": "https://www.amazon.com/AmazonBasics-Multipurpose-Copy-Printer-Paper/dp/B01FV0F8H8", "product_name": "Amazon Basics Multipurpose Copy Printer Paper, 8.5 x 11 inches, 20 lb, 1 Ream, 500 Sheets, 92 Bright, White", "price": "7.41", "currency": "$", "product_rating": "4.8", "Color": ["White"], "availability": true, "shipping": true, "delivery_date": "Tuesday, December 31", "delivery_cost": "104.15", "warranty": false, "warranty_policy": "Amazon.com Return PolicyAmazon.com Voluntary 30-Day Return Guarantee: You can return many items you have purchased within 30 days following delivery of the item to you. Our Voluntary 30-Day Return Guarantee does not affect your legal right of withdrawal in any way. You can find out more about the exceptions and conditions here.", "condition": "new", "image": "https://m.media-amazon.com/images/I/81x0cTHWQJL.__AC_SX300_SY300_QL70_ML2_.jpg", "latest_reviews": [{"reviewTitle": "High-quality paper", "reviewBody": "I recently decided to invest in high-quality printer paper for my home office, and I couldn’t be happier with my choice. Here’s a breakdown of my experience:PriceThe cost from Amazon Basics paper was less than standard printer paper, I found it to be quite reasonable for the quality provided. The investment paid off, as the paper is durable and produces excellent results, making it worth every penny.QualityThe quality of this paper is outstanding. It has a nice weight (around 20lb ), which feels substantial and prevents any tearing during printing. The smooth finish allows for even ink absorption, resulting in crisp, clear text and vibrant colors. Additionally, the high brightness level enhances the overall appearance of my documents.User ExperienceUsing this paper has been a game-changer. It’s compatible with both my inkjet and laser printers, with no jams or issues so far. I also appreciate that it’s made from sustainable materials, which aligns with my commitment to environmental responsibility. My printed documents now look professional, and I’ve received compliments on the quality of my reports and presentations.ConclusionOverall, purchasing high-quality printer paper was a great decision. It elevates my printing projects and ensures that everything I produce looks polished. I highly recommend it to anyone looking to enhance their printing experience!", "rating": "5.0"}, {"reviewTitle": "Functional, easy to purchase.", "reviewBody": "Well, now is my favorite brand in print patper. Price is affordable and always come next day delivery. Quality of the paper - great -  Just sometimes the cover package came off but I think is depends the shopper is in a good mood or bad mood  handle this product.", "rating": "5.0"}, {"reviewTitle": "Consistent Quality and Great Value!", "reviewBody": "The Amazon Basics Multipurpose Copy Paper exceeded my expectations in every way. It’s the perfect choice for anyone looking for reliable, high-quality paper for both personal and professional use. The 92 brightness provides sharp, crisp text and vibrant colors, whether you’re printing reports, flyers, or everyday documents.What truly stands out is the paper's smooth texture and consistent weight. At 20 pounds, it feeds through printers and copiers seamlessly without jamming—a major time-saver during high-volume jobs. The packaging is sturdy, and the 4,000-sheet supply ensures you won’t be running out anytime soon.I appreciate the value this product offers. Comparable options cost significantly more, but Amazon Basics delivers exceptional performance without breaking the bank. I’ve used it for everything from invoices to photo printing, and it holds up beautifully every time.If you’re on the fence, don’t hesitate—this paper is a solid choice for all your printing needs. Highly recommend!", "rating": "5.0"}, {"reviewTitle": "Pretty Solid paper, does suck in 2 pages at a time occasionally", "reviewBody": "This is probably the best deal for printer or all purpose paper on Amazon unless maybe you buy an even bigger quantity. This paper is solid and is fine for day to day use for printing homework pages etc. Occasionally, two pages get sucked in at once. I don't know if that is my printer or this paper, but it happens sometimes.I have bought other all purpose paper in the past and it was very thin. This is not thin, it is pretty thick for cheap paper. It also comes in a heft box that you can store.", "rating": "4.0"}, {"reviewTitle": "500 pack", "reviewBody": "No complaints here! Prints nicely with good color quality. Great value for my money 500pack. Goes through the printer seamlessy and is very easy to read. The paper is more on the thin side but it's not an issue for my needs.", "rating": "5.0"}, {"reviewTitle": "Good for our printer", "reviewBody": "We have bought this printer paper a couple of times. We're on our second box at this time. This paper works flawlessly in our printer. Never jams and the print jobs look great. As we use this at home, we don't use enough paper to justify a full case. This 3 ream box is just the ticket for us. Excellent per sheet cost as well!", "rating": "5.0"}, {"reviewTitle": "Great quality for the money", "reviewBody": "I have these in authorship every 6 months. The paper quality is great, the white color is white. I’ve had very few issues with jamming. Maybe one or two jams I can think of while printing somewhere in the 40-60 page range at once. I’ll continue to keep these on auto ship as the price is great for the quality.", "rating": "5.0"}, {"reviewTitle": "Good product", "reviewBody": "Awesome product and great pricing as well. This + ecotank printer u are sitting pretty for atleast a year.", "rating": "5.0"}, {"reviewTitle": "CALIDAD Y PRECIO", "reviewBody": "Me encanto el Papel por su uso en mi trabajo, la relación costo-Beneficio, excelente articulo ! Mismo articulo a mitad de su precio, Muy recomendable,  hay que Bucear, para encontrar grandes oportunidades, cada vez me sorprende Amazon, ( Soy un Adicto Amazónico ), son Geniales, comprare sus Acciones !! obtendré mas beneficios, conforme los aproveche, Non Plus Ultra !!!  de Empresa de Clase Mundial , Felicidades....", "rating": "5.0"}, {"reviewTitle": "Absolutely Essential Paper!", "reviewBody": "This AmazonBasics Multipurpose Copy Printer Paper is a game-changer! Here are all the incredible things you can do with it:Printing and Copying: Obviously, it’s perfect for all your printing and copying needs. Crisp, clean, and reliable every time.Origami Masterpieces: Transform these sheets into intricate origami creations. From cranes to dragons, the possibilities are endless!Paper Airplane Competitions: Host epic paper airplane tournaments. This paper’s perfect weight and texture ensure your planes will soar like never before.Emergency Fan: Feeling hot? Just grab a sheet and fan yourself. Instant relief!DIY Notebooks: Staple a few sheets together, and voilà! You’ve got yourself a handy notebook for jotting down all your brilliant ideas.Temporary Wallpaper: Want to redecorate? Cover your walls with this paper for a fresh, white look. Just tape it up and enjoy your new aesthetic.Pet Entertainment: Crumple a sheet into a ball and watch your cat go wild. Hours of feline fun!Impromptu Hat: Need a hat in a pinch? Fold a sheet into a stylish paper hat. Perfect for any occasion.Invisible Ink Detective Work: Write secret messages with lemon juice and reveal them with heat. Become the detective you always wanted to be!Paper Mâché Projects: Get crafty and create amazing paper mâché sculptures. Your creativity is the only limit.Emergency Shoe Insoles: Forgot your insoles? No problem! Just fold a few sheets and place them in your shoes for instant comfort.DIY Snowflakes: Cut out beautiful paper snowflakes to decorate your home for the holidays. Winter wonderland, here you come!Fake Mustaches: Cut out and tape on some hilarious fake mustaches. Perfect for parties or just a good laugh.Personalized Confetti: Shred a few sheets and make your own confetti. Great for celebrations or just to make a mess.Emergency Toilet Paper: In a pinch, this paper can save the day. Just make sure to use it sparingly!Paper Armor: Feeling medieval? Craft yourself some paper armor and have a jousting match with friends. Safety not guaranteed!DIY Kite: Build a simple kite and let it fly high. Perfect for a windy day at the park.Fake Money: Play a game of Monopoly with your own custom-made currency. Just don’t try to spend it!Paper Towel Substitute: Spill something? This paper can soak it up in a jiffy. Not the most absorbent, but it gets the job done.Message in a Bottle: Write a heartfelt note, roll it up, and place it in a bottle. Toss it into the sea and see where it ends up!", "rating": "5.0"}]}