{"product_url": "https://www.amazon.com/Dependable-Foods-Tomato-Sauce-California/dp/B0CVJVFPCQ", "product_name": "Dependable Foods Tomato Sauce - 106 oz.- Authentic California Vine to Bottle Blend - Kosher", "description": "Authentic Taste: Crafted from California's finest tomatoes, our Dependable Foods Tomato Sauce offers a truly authentic flavor profile.  Vine to Bottle: Made with care from vine to bottle, ensuring the freshest taste in every jar.  Kosher Certified: Our tomato sauce is kosher certified, meeting the highest standards of quality and purity.  Versatile Ingredient: Perfect for enhancing your favorite dishes, including pasta, pizza, and more.  Ingredients: Fresh Vine-Ripened Tomatoes, Sea Salt, Onion Powder, Garlic Powder, Natural Flavors, Spices and Citric Acid.", "price": "21.99", "currency": "$", "product_rating": "3.2", "Color": ["initial", "Pizza", "Ketchup", "Marinara", "Tomato Paste", "Tomato Sauce"], "availability": false, "shipping": false, "delivery_date": null, "delivery_cost": null, "warranty": false, "warranty_policy": null, "condition": "new", "image": "https://m.media-amazon.com/images/I/41nWf5pU4CL._SX300_SY300_QL70_ML2_.jpg", "latest_reviews": ["Strong tomato taste!", "This is a huge can of tomato sauce. My can arrived bent, but still not open and useable. The taste is pretty good, and of course you can add to it to make it your own. This size can would be great if you have an event or party that you need a ton of sauce for. Once you open it, there's really no closing it back up so you have to use it all or store it after.", "It is a good basic tomato sauce.  I use a can when I make up a batch of pasta sauce, which my wife uses for many applications.", "One can in this delivery for the price!!!!!😡😡😡", "The sauce I received does not look like the item displayed in the images. It appears that the brand is Masbia and not Dependable Foods, but if you look further down the can it says distributed by Dependable Foods. The marinara sauce seems to be certified Kosher if google accurately translated the text I found on the side of the can.<br/><br/>Taste: This is probably the first pre-made sauce I’ve ever had that didn’t need additional seasonings. The sauce was delicious and made great spaghetti. It is a bit sweet, so if you aren’t a fan of sweet spaghetti, you’ll need to find some way to adjust, but it was perfect for me.<br/>", "Our can was pretty beat up when we got it. It still had a proper seal though. It is decent. For last minute pizzas this will do. It doesn’t beat homemade but then again it’s not a convenient. It’s large so you can freeze it in smaller  portions."]}