{"product_url": "https://www.amazon.com/Classico-Signature-Recipes-Roasted-Tomato/dp/B00H3TKG6O/ref=zg_bs_g_6465030011_d_sccl_12/130-0780116-4726006?psc=1", "product_name": "Classico Family Favorites Traditional Pasta Sauce (24 oz Jar)", "description": "Deliver authentic Italian flavor to your family’s favorite recipes with Classico Family Favorites Traditional Smooth & Rich Pasta Sauce. Our ready-to-use sauce is easy to prepare and offers a rich, flavorful taste.Our sauce combines half a cup of vegetables per serving with the perfect fusion of tomato puree, basil and a hint of spice. Simply simmer and serve our traditional red sauce on your favorite pasta for a delicious meal. Use our gluten-free red sauce on your baked ziti, chicken parmesan or spaghetti and meatballs. Be sure to refrigerate our 24-ounce jar of sauce after opening. Classico has a flavor for everyone in your family, from Family Favorites Traditional Smooth & Rich Pasta Sauce to Vodka Sauce Pasta Sauce.", "price": null, "currency": null, "product_rating": 4.6, "Color": [], "availability": false, "shipping": false, "delivery_date": null, "delivery_cost": null, "warranty": false, "warranty_policy": null, "condition": "new", "image": "https://m.media-amazon.com/images/I/41dtGUjEl7L._SX300_SY300_QL70_ML2_.jpg", "latest_reviews": [{"reviewTitle": "Finally a simple, smooth red sauce that I can doctor.", "rating": 5, "reviewBody": "Too many companies are producing marinara and sauces with all kinds of \"stuff\" in them. I missed the basic smooth, red sauce that I could season to my taste.Classico is perfect. This is my first time using it  and my sauce turned out so yummy....ALMOST as good as my Nonna's scratch sauce.Classico has a deep red color, smells great, and, most importantly, is smooth. (No respectable Italian wants big chunks of tomato in her red sauce) Make sure the label reads, \"Classico Family Favorites Traditional Pasta Sauce.\" (I cannot find this variety at my local grocery stores.)Classico will be my go-to sauce from now on. It's priced lower than most jar sauces and the quality is better. I also tried their pizza sauce recently and loved it.Why did I wait so long to try Classico??\n"}, {"reviewTitle": "IT'S CLASSICO - ALWAYS GREAT", "rating": 5, "reviewBody": "I used to cater Italian meals, so I am familiar with many different sauces.  Classico is one I really like, because I can tweak it however I want, or use straight on french bread, crusty rolls or pizza dough to make a great treat.  Quality is always there. It IS a bottled sauce, so not the same as starting from scratch (for us puritans), but it is just plain handy for when I don't have several hours to put something together."}, {"reviewTitle": "Great buy, great taste!", "rating": 5, "reviewBody": "It's getting difficult finding the \"plain\" one in the stores so I am VERY happy to get these from Amazon.  I was concerned about glass shipping  but they were well packaged so no problem."}, {"reviewTitle": "Too small for the price", "rating": 4, "reviewBody": "Its very tasty pasta in a pinch is ok. for this price you should get 48 oz at least"}, {"reviewTitle": "Good as always", "rating": 5, "reviewBody": "Makes a good base for my sauce."}, {"reviewTitle": "Tasty", "rating": 5, "reviewBody": "Good quality, good flavors"}]}