{"product_url": "https://www.amazon.com/Hammermill-Paper-letter-Bright-Sheets/dp/B01MTJEHYA", "product_name": "Hammermill A4 Paper, 20 lb Copy Paper (210mm x 297mm) - 1 Ream (500 Sheets) - 92 Bright, Made in the USA, 105500R, White", "price": "9.89", "currency": "$", "product_rating": "4.6", "Color": ["White"], "availability": true, "shipping": true, "delivery_date": "Tuesday, December 31", "delivery_cost": "171.36", "warranty": false, "warranty_policy": "Amazon.com Return PolicyAmazon.com Voluntary 30-Day Return Guarantee: You can return many items you have purchased within 30 days following delivery of the item to you. Our Voluntary 30-Day Return Guarantee does not affect your legal right of withdrawal in any way. You can find out more about the exceptions and conditions here.", "condition": "new", "image": "https://m.media-amazon.com/images/I/71NPnmZyDcL.__AC_SX300_SY300_QL70_ML2_.jpg", "latest_reviews": [{"reviewTitle": "A Game-Changing Stack of A4 Paper - My Life Will Never Be the Same!", "reviewBody": "Rating: 5/5 stars (would give more if possible)\n\nI just used the most incredible, life-altering, and awe-inspiring product - a stack of A4 paper! I mean, where do I even begin?\n\nPros:\n\n- It's paper. Like, actual paper. I can touch it, feel it, and even smell that fresh paper scent (don't judge me).\n\n- It's A4-sized, because who needs anything else? It's like the Goldilocks of paper sizes - just right.\n\n- The stack is so sturdy, I can almost use it as a paperweight (almost).\n\n- Perfect for writing, printing, doodling, or creating an epic paper fort (I did that).\n\nCons:\n\n- Ran out of product to write this review because I used all the paper.\n\n- Now I need to buy more, which is really an investment in my happiness.\n\n- May cause excessive paper airplane creation.\n\nIn conclusion, this A4 paper stack has exceeded my expectations. It's a game-changer, a life-changer, and a paper-changer. If you don't have one, what are you even doing with your life? Get yourself a stack (or three) and experience the pure joy of paper!\n\nP.S. If anyone needs me, I'll be in my paper fort, surrounded by A4 bliss.\n\n(In the words of Shwepps, “It’s paper. What did you expect?)", "rating": "5.0", "reviewDate": "August 11, 2024"}, {"reviewTitle": "paper", "reviewBody": "great product and ink prints clearly on it no runs", "rating": "5.0", "reviewDate": "October 7, 2024"}, {"reviewTitle": "Hammer mill printing paper", "reviewBody": "I like the price and quality", "rating": "5.0", "reviewDate": "September 10, 2024"}, {"reviewTitle": "Great paper", "reviewBody": "The best thing about this product is that is acts just like paper.", "rating": "5.0", "reviewDate": "October 18, 2024"}, {"reviewTitle": "Pretty thin", "reviewBody": "It's too thin for my liking - you can see through it, but it will do. Quality is great, I just wish it came in a higher weight.", "rating": "4.0", "reviewDate": "July 7, 2024"}, {"reviewTitle": "Good quality!", "reviewBody": "Good quality paper.  Bright and has a decent thickness to it. No issues with ink smearing or adhering.\n\nI use these when I need to print off important documents to send off or for presentation purposes.", "rating": "5.0", "reviewDate": "February 26, 2021"}, {"reviewTitle": "Great", "reviewBody": "I liked the feel of the paper.", "rating": "5.0", "reviewDate": "December 6, 2021"}, {"reviewTitle": "Decent Quality and Value", "reviewBody": "Decent quality and value.", "rating": "5.0", "reviewDate": "October 27, 2024"}, {"reviewTitle": "Cumple con la descripción", "reviewBody": "Muy blancas", "rating": "5.0", "reviewDate": "March 23, 2020"}]}