{"product_url": "https://www.amazon.ca/RAYMYLO-Insulated-Stainless-BPA-Free-Paracord/dp/B0BZZSC2J2/ref=zg_bs_g_2406090011_d_sccl_3/147-3138118-7506061?psc=1", "product_name": "RAYMYLO One Gallon Water Bottle Insulated, Triple Walled Vacuum Stainless Steel (Cold for 48 Hrs), Leak Proof & BPA-Free, Large Water Flask Jug with Paracord Handle & Straw Spout Lids", "description": "Triple Wall Insulation: Raymylo 128 oz One Gallon Insulated Water Bottle featuring copper plated triple wall vacuum insulation, is tested to keep your drinks icy cold for up to 48 hrs and reassuring warm 24 hrs. Get this iconic water bottle to up your fitness track, you'll fall for hydrating as every sip is absolutely cool.  Full Seal Leak-proof Lids: All scenario spout and straw lid with rubber seal ring ensures not a single drop leaks no matter how bumpy your journey gets.Straw lid allows for a quick refreshment without stopping you, while spout lid is great for proper hydration whenever you feel like a boost.Keeps your drinks fresh and spill-free on the go.  Iconic Paracord Handle: This insulated water bottle comes with a beautiful hand knit nylon paracord in coordinated color with the water bottle. Configured with a compass and carabiner, this paracord handle is a must-have as a full functional camping / hiking flask.  Made for Clean and Healthy Drinkers: Built with select 18/8 food-grade stainless steel that's BPA-free and odor-free, making it a sustainable choice for you and the environment. This water jug has a wide mouth opening, making ice adding and washing super handy. Powder coating adds a sturdy and refined finish that won't sweat, condense, or slip in wet palms.  What You'll Get: We offer lifetime warranty and 100% customer satisfaction against any leakage or insulation failure. You purchase contains: RAYMYLO 64oz/128oz Water Bottle, Carrying Pouch, Straw Lid with 2 Straws & Straw Brush, Spout Lid, Paracord Handle, Bottle Brush", "price": "47.16", "currency": "$", "product_rating": "4.7", "availability": true, "shipping": true, "delivery_date": "Saturday, January 25", "delivery_cost": "FREE", "warranty": true, "image": "https://images-na.ssl-images-amazon.com/images/I/81KC5W-1KKL._AC_UL116_SR116,116_.jpg", "latest_reviews": [{"reviewer": "Roxanne", "rating": 5.0, "comment": "Excellenty quality, great price,"}, {"reviewer": "Aly", "rating": 5.0, "comment": "It makes you want to drink more water!"}, {"reviewer": "TorontoOntarioCanada", "rating": 5.0, "comment": "Well designed and cool"}, {"reviewer": "Manoj Kamath", "rating": 4.0, "comment": "Great thermos bottle, weak plastic snap-on w/compass"}, {"reviewer": "Oinyo", "rating": 5.0, "comment": "Easily best water bottle I have ever had"}, {"reviewer": "Beeyaach & Chisel", "rating": 5.0, "comment": "Best multiuse travel bottle around!"}]}