{"product_url": "https://www.amazon.ca/Opard-Sports-Reusable-Plastic-Outdoor/dp/B0897MN4WY/ref=zg_bs_g_2406090011_d_sccl_36/147-3138118-7506061?psc=1", "product_name": "Opard Sports Water Bottle 900ml Leak Proof Flip Top BPA Free Tritan Plastic Drinking Bottle for Gym, School, Outdoor", "description": "TRANSLUCENT AND MATTE - This water bottle is a matte finish that is very stylish and beautiful, and you can see clearly how much water was drinking from the scale of the bottle.  REMOVABLE STRAINER - While tap water tastes boring and tedious, this strainer/filter allows you to infuse fruit & tea in your bottle and the wide mouth is extremely enough to fit ice cubes.  PRACTICAL DESIGN - Lightweight with a durable carry-ring, so you can carry your bottle easily. Also, simply push the secure lock releasing flip top lid just by one hand.  BPA & TOXIN FREE - This 30oz/900ml frosted water bottle is made of 100% BPA free Non-toxic Tritan, PP plastic material lid, and food-grade silicone leak-proof dust-proof seal, eco-friendly choice.  IDEAL GIFT FOR FITNESS - May your best friend love camping, cycling, traveling, outdoor activities, or hit the gym regularly, this excellent bottle is the best gift you can think of now!", "price": "16.99", "currency": "$", "product_rating": "4.3", "availability": true, "shipping": true, "delivery_date": "Saturday, January 25", "delivery_cost": "FREE", "warranty": false, "image": "https://m.media-amazon.com/images/I/31BRa6DtB-L._SS60_.jpg", "latest_reviews": [{"review_title": "Durable", "rating": 5.0, "review_text": "Great water bottle. Nice colours. Holds a lot. Durable. Will not break or crack and then leak when dropped."}, {"review_title": "Excellent bottle", "rating": 5.0, "review_text": "Perfect size and has a great seal for it to be leak proof when closed. I also like the colour."}, {"review_title": "Sturdy", "rating": 4.0, "review_text": "Not the most attractive look, but its still functional."}, {"review_title": "New bottles new year", "rating": 5.0, "review_text": "I added these as part of my teenage boys Christmas gifts. They appear great so far even though they haven't had a chance to use them yet"}, {"review_title": "Water bottle", "rating": 5.0, "review_text": "Good quality."}, {"review_title": "It's alright.", "rating": 3.0, "review_text": "Decent water bottle until the seal proof plastic slips and then water leaks everywhere, constantly having to adjust it back into place"}, {"review_title": "Great for the gym!", "rating": 5.0, "review_text": "The cover & snap close tight, so no leaks. Great quality for the price!"}]}