{"product_url": "https://www.amazon.ca/YETI-Rambler-Insulated-Stainless-Matching/dp/B0CT687RJ2/ref=zg_bs_g_2406090011_d_sccl_29/147-3138118-7506061?psc=1", "product_name": "YETI Rambler 26 oz Bottle, Vacuum Insulated, Stainless Steel with Color Matching Straw Cap, King Crab", "description": "Housing 26 ounces of thirst quenching power and made to fit in your backpack, this one’s been dubbed the goldilocks of the YETI Bottle line. And with the leak-resistant YETI Straw Cap, you’ve got a bottle made for every day, easy sippin’. It’s your on-hand hydration during all-day waterfront ventures, long hikes, and midsummer heat waves. Like the rest of the YETI Rambler Family, it’s built with double-wall vacuum insulation to keep drinks cold all day, comes in DuraCoat colors that won’t peel or crack, and has a YETI TripleHaul Handle for easy carries. To top it off, it’s dishwasher safe for quick cleans while you plan your next venture. Note: Do not use the YETI Rambler Bottle Straw Cap with hot, carbonated, or pulpy beverages or for storage of food or perishables.", "price": "40.00", "currency": "$", "product_rating": 4.7, "availability": true, "shipping": true, "delivery_date": "Monday, January 27", "delivery_cost": "FREE", "warranty": null, "image": "https://m.media-amazon.com/images/I/51+uMqKxt-L._AC_.jpg", "latest_reviews": [{"reviewer": "Jenna", "rating": 5.0, "title": "Kids love them!", "text": "If you’re looking for a reliable, stylish, and high-performing bottle for daily use or outdoor adventures, the YETI Rambler 26 oz Bottle is a fantastic investment. We bought these for our children aged 8 and 10 and they’re the perfect size for drinking water during the day. They keep your water cold and ice cubes are still going the next day!"}, {"reviewer": "David", "rating": 5.0, "title": "Best bottle ever", "text": "Ease of carrying, ease of cleaning cold retention and very good quality"}, {"reviewer": "Micheline ", "rating": 5.0, "title": "Great water bottle", "text": "Good size, sturdy,easy to use,keeps cold a long time. Only need one of these to do the job!"}, {"reviewer": "Travis", "rating": 5.0, "title": "Excellent Quality", "text": "The colour is really nice and it keeps drinks cold and the sstraw is excellent for drinking water at the gym or in the car.."}, {"reviewer": "gretadanielle", "rating": 5.0, "title": "I waited too long to buy one!", "text": "Best water bottle. I waited too long to buy one as I have been using a cheaper version...."}, {"reviewer": "Jess", "rating": 5.0, "title": "Great product", "text": "As advised. Nice bright colour, came with two bendable straws."}, {"reviewer": "HONEYLET RIVERA", "rating": 5.0, "title": "Durable", "text": "I really like the colour and of course the fact that the yeti keeps everything hot or cold for a long time"}]}