{"product_url": "https://www.amazon.ca/Hydra-Cup-Protein-Stainless-Barbell/dp/B0CNY1SG1J/ref=zg_bs_g_2406090011_d_sccl_17/147-3138118-7506061?psc=1", "product_name": "Hydra Cup Pro [2 Pack] with Hidden Carry Hook | Heavy Duty 28oz Protein Shaker Bottle | Stainless Steel Barbell Blender & Ice Blocker for Mixing Powders (Black, Grey, 28 Ounce)", "description": "HEAVY DUTY BOTTLE BASE - increased bottle thickness (15% thicker than Hydra Cup OG bottles) & impact protection design make this new bottle virtually unbreakable.  HOUDINI HOOK (Hidden Carry Loop) - our carry loop will never get in your way or unintentionally catch on something; it’s there when you need it and tucked away when you don’t.  ALWAYS DRINK COMFORTABLY - On other shakers the flip cap will hit your nose unless you tilt your neck way back or drink from the side. Hydra Cup Pro is designed with a special space so you can tilt back and drink comfortably until the very last drop.  SPOUT SHIELD - the new flip cap has an added shield to protect your thumb from making direct contact with the spout. This help keeps the spout area clean.  PRINTED MEASUREMENT LINES - Large Printed Ounce Lines So Your Not Squinting To See Them Like Non-Printed Engraved Markings", "price": "21.79", "currency": "$", "product_rating": 4.5, "availability": true, "shipping": true, "delivery_date": "Saturday, January 25", "delivery_cost": "0.0", "warranty": false, "image": "https://m.media-amazon.com/images/I/615wnuU9ZqL.jpg", "latest_reviews": [{"reviewTitle": "Fantastic value", "reviewText": "These are SO NICE for the price. Really solid. Cap does not leak whatsoever. Handle is convenient. Has measurements so you can track your consumption. I love it.", "reviewRating": 5.0, "reviewDate": "December 18, 2024"}, {"reviewTitle": "Doesn't Leak", "reviewText": "They work well and don't leak. I've run mine through the dishwasher a few times now, and they are still holding strong. The price point is great, too, compared to other brand names (which usually don't last anyway). No weird plastic smell either.", "reviewRating": 5.0, "reviewDate": "October 18, 2024"}, {"reviewTitle": "Good price for 2 Shaker bottles", "reviewText": "For some reason all my Shaker bottles have been breaking recently so I wanted a cheaper alternative to ones from \"supplement stores\".These bottles are good quality, a great price, and I like the interesting shaped mixer. Not the usual sphere. Also the strainer on the top would be good for those stubborn powders that just don't want to mix. Good to have just in case !", "reviewRating": 5.0, "reviewDate": "July 9, 2024"}, {"reviewTitle": "Great for mixing powders into your drink", "reviewText": "I love that I got two of these for so little. I love that the drink is so easy to shake with no clumps. I would recommend this product to anyone who is looking for a shaker bottle that is easy to use and clean.", "reviewRating": 4.0, "reviewDate": "July 9, 2024"}, {"reviewTitle": "Great product at an affordable price", "reviewText": "These bottles are just as good, or even better, to the blender bottles I had previously. The strainer at the top is an added bonus that I didn’t really think I needed but enjoy having. The carrying handle on top was the thing I really wanted. The plastic feels slightly cheaper than the blender bottles but I’m not concerned about it. These bottles are well thought out and I definitely recommend them over the higher priced versions.", "reviewRating": 4.0, "reviewDate": "November 27, 2024"}]}