{"product_url": "https://www.amazon.ca/Zak-Designs-Hedgehog-Durable-Leak-Proof/dp/B0CK1R26WN/ref=zg_bs_g_2406090011_d_sccl_9/147-3138118-7506061?psc=1", "product_name": "Zak Designs Sonic the Hedgehog Water Bottle For School or Travel, 16oz Durable Plastic Water Bottle With Straw, Handle, and Leak-Proof, Pop-Up Spout Cover (Sonic, Eggman)", "description": "Let kids enjoy hydration with a fun water bottle by Zak Designs! Reusable and Durable Material: Reusable water bottles will last wash after wash—good news for you and the environment! The 16 oz water bottle is made of PP plastic, durable enough for kids to use every day and bring on any adventure. Leak-Proof Lid: The lid screws on securely and won't leak when the spout is closed, though water flows for easy drinking when the spout is open. The easy-open button has a flip-up lock to keep it from activating accidentally. On the Go: The water bottle has a built-in carrying loop on the lid for easy transportation, and with the spout cover to keep the spout clean and closed, it can be tossed into a bag for worry-free travel. Specifications: 16 oz capacity. Made of durable plastic. BPA-Free - Zak is committed to safety. Dishwasher safe, do not microwave. Length: 4.33-inch, Width: 2.78-inch, Height: 7-inch. Character: Sonic, Doctor Eggman (Sonic the Hedgehog).", "price": "13.85", "currency": "$", "product_rating": 4.3, "availability": true, "shipping": true, "delivery_date": "Saturday, January 25", "delivery_cost": "FREE", "warranty": false, "image": "https://m.media-amazon.com/images/I/41IcRiWmbvL._SS75_.jpg", "latest_reviews": [{"reviewer": "Sara Bustard", "rating": 5.0, "comment": "Good bottle for the price!", "date": "December 27, 2024"}, {"reviewer": "CNR", "rating": 5.0, "comment": "Water bottle", "date": "December 27, 2024"}, {"reviewer": "Ivan.M.", "rating": 4.0, "comment": "A good product", "date": "March 9, 2024"}, {"reviewer": "Kindle Customer", "rating": 5.0, "comment": "Vibrant!!", "date": "March 9, 2024"}, {"reviewer": "Amazon Customer", "rating": 5.0, "comment": "Don’t have to touch the spout", "date": "March 9, 2024"}, {"reviewer": "Amazon Customer", "rating": 1.0, "comment": "Don't waste your money", "date": "March 9, 2024"}, {"reviewer": "Tammy", "rating": 5.0, "comment": "Great bottle!!!Decided on this bottle after reading the reviews. When it arrived I was worried that my son would have difficulty getting it opened since it was a little bit hard to push and close. After a couple days of usage it was just that it was new and needed to be used! Great bottle, durable and easy for toddlers to use. It does leak out the straw if left on side but minor negative to all the positives", "date": "March 9, 2024"}]}