{"product_url": "https://www.amazon.ca/Sports-Bottle-Drinking-Camping-Workouts/dp/B0B18PRPK5/ref=zg_bs_g_2406090011_d_sccl_38/147-3138118-7506061?psc=1", "product_name": "GIFUBOWA Sports Water Bottle 2.2L BPA Free Leak Proof Big Drinking Jug for Camping Workouts", "description": "【All Day Hydration】2.2L big water bottles with capacity markers can help you boost your all-day hydration, replenish your moisture loss during exercising, supporting your healthy lifestyle.  【Eco-friendly & BPA Free】Half Gallon water jug are made of high-quality food-grade reusable plastic, which is BPA-free, Odorless, thick and durable. It is recyclable, saves the environment from lots of single-use plastic bottle waste.  【Motivational Quote & Time Marker】Our ergonomic and practical drinkings jug features a unique time markings and motivational quote on the exterior, which can help you monitor your daily water intake effortlessly, reminding you keep hydrated and drink enough water throughout the day.  【Leak - proof & Portable 】100% leak-proof lids and the easy-taking handle, great for all kinds of indoor and outdoor activities, such as cycling, running, camping, hiking, yoga, pilates ect.  【Ideal Gift Choice】GIFUBOWA large bottle is super easy to hold and carry with you, Comes with different color, it is an ideal for your beloved ones, to help them keep hydrated and healthy!", "price": "25.96", "currency": "$", "product_rating": 4.3, "availability": true, "shipping": true, "delivery_date": "Saturday, January 25", "delivery_cost": "FREE", "warranty": false, "image": "https://m.media-amazon.com/images/I/41B4R9DSOyL._SS75_.jpg", "latest_reviews": [{"reviewTitle": "Good", "rating": 5.0, "reviewText": "J’ai vu quelques commentaires sur le goût de plastic dans la bouteille je l’utilise depuis seulement 2 jours mais si elle n’est pas avec moi, et qu’il reste de l’eau je mets au frigo. Aucun goût de plastique et taille parfaite!À suivre", "reviewerName": "Helene Ricard-Bouchard"}, {"reviewTitle": "great quality and size", "rating": 5.0, "reviewText": "highest quality water bottle I’ve ordered so far on Amazon highly recommend for gym and or work", "reviewerName": "Arman Bulic"}, {"reviewTitle": "Great for staying hydrated throughout the day", "rating": 4.0, "reviewText": "It’s a great size and works well to bring to work ensuring I’m drinking enough water throughout the day....", "reviewerName": "Kevin"}, {"reviewTitle": "It does leak from the spout --&gt; RESOLVED", "rating": 5.0, "reviewText": "Excellent customer service. After I posted my review about the leaky lid, customer service reached out to me and shipped me a new lid...", "reviewerName": "munchkin"}, {"reviewTitle": "Decent bottle", "rating": 5.0, "reviewText": "Love all aspects of it so far, non leak as advertised 👍color is pretty cute too! The big thick straw definitely helps to intake more water ....", "reviewerName": "Fannie"}, {"reviewTitle": "As advertised", "rating": 5.0, "reviewText": "Tough bottle stands up to a lot of wear and tear", "reviewerName": "mairi gillingham"}, {"reviewTitle": "Best 2L waterbottle yet!", "rating": 1.0, "reviewText": "I'm very pleased with my purchase, however, the straw was too short so I had to remove it and just drink from the opening. So far no leaks....", "reviewerName": "Liza MaRoni"}, {"reviewTitle": "Large, convenient, useful, but cheaply made", "rating": 4.0, "reviewText": "Love the product and the idea, not in love with the quality. Bought this bottle to drink more water at work, and that I am....", "reviewerName": "Justin Dobbs"}]}