{"product_url": "https://www.amazon.ca/Glass-Juice-Bottles-Pack-500ml/dp/B0D2B6HKD7/ref=zg_bs_g_2406090011_d_sccl_47/147-3138118-7506061?psc=1", "product_name": "Glass Juice Bottles 4 Pack 16oz/500ml - Wide Mouth Glass Water Bottles with Lids - for Juicing, Smoothies, Milk, Protein, BPA Free, Reusable, Stainless Steel Lids, Leak Proof, Shaker bottle", "description": "Elevate Your Beverage Experience: Introducing our premium glass juice bottles, available in 10oz, 12oz, 16oz and 20oz sizes. Crafted from high-quality borosilicate glass, each bottle is equipped with stainless steel lids and filters for a leak-proof seal. Perfect for enjoying fresh juices, protein shakes, and creamy milk beverages, these bottles are your go-to solution for staying refreshed and energized.  Versatility Meets Convenience: With wide mouths and convenient measurement markings, our bottles are designed for ease of use. Whether you're blending up a post-workout protein shake, whipping up a fruity smoothie, or storing homemade juice for later, these bottles offer unmatched versatility and convenience.  Sustainability in Style: Say goodbye to disposable plastic containers and hello to eco-friendly elegance. Our reusable glass bottles not only reduce waste but also add a touch of sophistication to your kitchen. With their dishwasher-safe design, they're a practical and sustainable choice for everyday use.  Seal in Freshness, Seal in Flavor: Enjoy your favorite beverages without worrying about leaks or spills. Our bottles feature airtight stainless steel lids that keep liquids securely sealed, whether you're storing them in the fridge, taking them on the go, or shaking up a refreshing drink. Keep your drinks fresh, flavorful, and ready to enjoy anytime, anywhere.  Embrace the Power of Quality: Made from durable borosilicate glass and featuring leak-proof stainless steel lids, our bottles are built to last. Whether you're sipping on a hot cup of coffee or savoring a cold glass of juice, these bottles deliver unbeatable performance and style. Upgrade your beverage experience with our premium glass juice bottles today!", "price": "32.99", "currency": "$", "product_rating": 4.5, "availability": true, "shipping": true, "delivery_date": "Saturday, January 25", "delivery_cost": "0.0", "warranty": false, "image": "https://m.media-amazon.com/images/I/41GbwUW6qRL._SS75_.jpg", "latest_reviews": [{"reviewer": "Amazon Customer", "rating": 5.0, "comment": "Nice quality product"}, {"reviewer": "RS", "rating": 5.0, "comment": "Ring damaged\/used. Otherwise great bottles."}, {"reviewer": "Sabine", "rating": 4.0, "comment": "Exactly as described, markings not dishwasher safe"}, {"reviewer": "Y. B.", "rating": 5.0, "comment": "Gorgeous perfect bottles"}, {"reviewer": "Telina", "rating": 5.0, "comment": "Great"}, {"reviewer": "J.Oxford", "rating": 5.0, "comment": "Perfect!"}, {"reviewer": "Nicky", "rating": 5.0, "comment": "Good"}, {"reviewer": "Lorenza", "rating": 5.0, "comment": "Four piece easy to clean"}]}