{"product_url": "https://www.amazon.ca/Owala-Insulated-Stainless-BPA-Free-Tropical/dp/B0CV1F1W7K/ref=zg_bs_g_2406090011_d_sccl_24/147-3138118-7506061?psc=1", "product_name": "Owala FreeSip Insulated Stainless Steel Water Bottle with Straw for Sports and Travel, BPA-Free, 24-oz, Orchid/Orange (Tropical)", "description": "The Owala FreeSip Insulated Stainless-Steel Water Bottle with Locking Push-Button Lid easily tackles every thirst. With a built-in, easy-clean straw and a wide-mouth opening, the FreeSip reusable bottle is designed for drinking two different ways: sipping upright through the straw or tilting back to swig from the wide-mouth spout opening. Add in a push-to-open lid and playful colors, and staying hydrated has never been simpler—or more fun. Additional features include double-wall insulated stainless steel that keeps drinks cold up to 24 hours, a carry loop that doubles as a lock, a cup holder-friendly base, and a wide opening for easy cleaning and adding ice. The Owala FreeSip Insulated Stainless-Steel Water Bottle with Locking Push-Button Lid is available in three sizes: 24-Ounce, 32-Ounce, and 40-Ounce. Lid is dishwasher safe; hand wash cup. Not for use with hot liquids. Manufacturer’s limited lifetime warranty.", "price": "41.99", "currency": "$", "product_rating": 4.7, "availability": true, "shipping": true, "delivery_date": "Saturday, January 25", "delivery_cost": "FREE", "warranty": true, "image": "https://m.media-amazon.com/images/I/21jReQjt3YL._SS75_.jpg", "latest_reviews": [{"review_title": "Great water bottle!", "review_rating": 5.0, "review_text": "No leakage, keeps drinks very cold.", "reviewer": "Kayla A"}, {"review_title": "Love this", "review_rating": 5.0, "review_text": "Having this leak proof is the absolute best. Keeps ice in drinks over night. Fits in car cup holder. What is not to like.", "reviewer": "Kim W"}, {"review_title": "We love this water bottle", "review_rating": 5.0, "review_text": "The colour is vibrant, the quality is great, the size is great and my daughter loves the spout/straw option", "reviewer": "Shannon"}, {"review_title": "The best water bottle", "review_rating": 5.0, "review_text": "The colors are as vibrant as the picture and it’s just the best water bottle. The Stanley cups are just too chunky for me.", "reviewer": "Alex"}, {"review_title": "Great bottle", "review_rating": 5.0, "review_text": "Great water bottle! Love the option of a straw or large drink! Good size for taking to school or work for the day.", "reviewer": "Emma Ebbett"}, {"review_title": "I love this water bottle", "review_rating": 5.0, "review_text": "I usually use the straw but once in awhile tip it. The orange and pink colourway is bright and cheerful. Totally leak proof. Keeps water cold for a long time. Easy to clean.", "reviewer": "AshleyOMara"}, {"review_title": "Worth the hype", "review_rating": 5.0, "review_text": "Perfect water bottle for hikes and generally just for drinking. I love this water bottle.", "reviewer": "Alannah Lax-Vanek"}, {"review_title": "Daughter loves it", "review_rating": 5.0, "review_text": "Absolutely loves it easy to put in her bag to take to school with no leaking in a perfect size", "reviewer": "Karim"}]}