{"product_url": "https://www.amazon.ca/MILTON-Bottle-School-Portable-Stuffers/dp/B0BVP6CM2Q/ref=zg_bs_g_2406090011_d_sccl_48/147-3138118-7506061?psc=1", "product_name": "MILTON 8 pack 6 oz Kids Water Bottle for School Leak Free Flip Lid- Portable Small Sports Water Bottle for Adults Carry Strap Party Favors for Kids Treats Prizes Gifts Goodie Bag Stuffers Bulk Pack", "description": "Great for a range of drinks Fill with water, juice or soda and keep cool by placing your bottle in the refrigerator or freezer. Add ice to your favorite drink by removing the screw cap and keep hydrated with ease thanks to the integrated flip lid. Keep it with you when you’re running on the treadmill, walking the dog, or picking the kids up from day care. It is the most practical way to save money on drinks when you’re out as you can refill it for pennies at home. A great gift If you’re stuck to know what to buy a friend or family member for their Birthday or Christmas then look no further than one of our 200ml reusable bottle multipacks. They are a must have for anyone. Simply fill with water or juice at home and you’re set for the day! You can even prepare it the night before and keep it in the freezer overnight, perfect for when the weather is hot. Easy to clean Dishwasher safe, you don’t have to worry about handwashing fiddly bottles at the end of every day. Simply unscrew the cap from the bottle and place them both in the dishwasher then wash on your normal cycle for sparkly clean bottles every time. BUY NOW and choose our reusable 200ml bottles as a safer, eco-friendly alternative to single use plastic bottles", "price": "25.99", "currency": "$", "product_rating": 4.6, "availability": true, "shipping": true, "delivery_date": "Saturday, January 25", "delivery_cost": "FREE", "warranty": false, "image": "https://m.media-amazon.com/images/I/51SVV6TlPCL.jpg", "latest_reviews": [{"rating": 5.0, "text": "Perfect bottles for my elementary school daughter. Doesn't leak. Easy to clean! Decent size and price! We recommend!", "date": "October 27, 2024"}, {"rating": 5.0, "text": "I bought these because I needed very small bottles for juice and milk for lunches that were easy to clean and wouldn't leak. I'm SERIOUSLY impressed with these. I was originally going to order Tupperware that I had seen that are essentially the same, but they were seriously out of my price range ($60 for four!). Man am I glad I tried these out! I removed the string/strap things because they weren't needed. These go through the dishwasher just fine and do not leak.I was quite wary about whether they would leak or not, so I put them through the test. I filled them halfway with water and shook upside down with the lid on, turned on their side and jiggled around. Not a drop. They've been going through lunches for about a week or so now and zero leaks, zero staining, zero odor absorption. They come out of the dishwasher clean as clean can be and ready to be used again.I 100% recommend these if you need good little lunch bottles.", "date": "January 17, 2024"}, {"rating": 5.0, "text": "Good for kids lunch boxes", "date": "January 17, 2024"}, {"rating": 4.0, "text": "Bottles", "date": "December 2, 2023"}, {"rating": 5.0, "text": "Work well", "date": "November 27, 2023"}]}