{"product_url": "https://www.amazon.ca/YETI-Yonder-Water-Bottle-Power/dp/B0CF6XGB8R/ref=zg_bs_g_2406090011_d_sccl_41/147-3138118-7506061?psc=1", "product_name": "YETI Yonder 1L / 34oz Water Bottle with Yonder Chug Cap, Power Pink", "description": "If you can get there, now your water can too. The YETI Yonder 1L / 34oz Water Bottle was strategically engineered to be both lightweight and shatter resistant, allowing you to haul essential hydration further and higher. But a bottle is only as good as its top, which is why the YETI Yonder Cap is 100% leakproof and provides quick sips through the spout or opens up wide for refills and washing. Please note: Do not use this Yonder Bottle and Cap with hot, or carbonated beverages or use as storage for food or perishables.", "price": "38.00", "currency": "$", "product_rating": 4.7, "availability": true, "shipping": true, "delivery_date": "Saturday, January 25", "delivery_cost": "FREE", "warranty": false, "image": "https://m.media-amazon.com/images/I/51qQhdFxd0L._AC_.jpg", "latest_reviews": [{"review": "I’ve had the Yeti Yonder water bottle for nearly 4 months now and it’s been great. I take it with me to work daily. Never has leaked and it holds enough that I don’t need to refill it at work.<br><br/>Pros: light weight, large, doesn’t leak, looks good, durable.<br/>Cons: obviously it’s not going to keep your water cold, the bottle sweats with cold fluids. Price.<br/><br/>I use this water bottle all the time and has been worth the money for me. I may even get a smaller Yonder to use around the house.<br/>", "rating": 5.0, "date": "December 15, 2024"}, {"review": "Highly recommended.  We've had many BPA free plastic water bottles but the problem is that is the lids always break eventually.  This one has suffered many falls and is rock solid.  Great quality and worth the higher price.", "rating": 5.0, "date": "October 16, 2024"}, {"review": "I love this bottle. It's very classy and I get compliments (people think it's glass). It's expensive, but I thought it was worth the price since it's dishwasher safe and I'm terrible for remembering to hand wash my bottles. However, I have been surprised to notice that it seems to smell after only a few days of being washed. I guess it's good cause it forces me to wash it regularly. But is kinda odd.<br><br/>Also, it doesn't perfectly fit in my 2016 Altima car holder. It does fit, but it's too big to slide all the way down. Some newer cars have bigger holders.", "rating": 4.0, "date": "December 23, 2024"}]}