{"product_url": "https://www.amazon.ca/ETDW-Gallon-Motivational-Cleaning-Leakproof/dp/B0881KG7BP/ref=zg_bs_g_2406090011_d_sccl_10/147-3138118-7506061?psc=1", "product_name": "ETDW Gallon Water Bottle with Straw and Time Marker, 128OZ/74OZ Huge Sport Drinking Bottle with Handle BPA Free, Leakproof Big Water Container for Fitness, Gym, Yoga and Outdoor", "description": "HEALTHY WATER BOTTLE: ETDW gallon water bottle jug is made of eco-friendly PETG plastic, which is not only 100% BPA free, non-toxic and no harmful substances but also lightweight and sturdy! The 128OZ/74OZ capacity large water jug is thick, durable and reusable, a healthy large water bottle for you and your family!  MOTIVATIONAL & PORTABLE JUG: The gallon water bottle with time marker was silkscreened 8-time markers from 7 am to 9 pm on the body, which will accurately remind you to drink enough water; The designed of the gym water bottle with a strong handle, nylon woven strap and 100% leak-proof lid is easy to carry to outside, gym, office, and outdoor recreations.  WIDE MOUTH & SOFT SILICONE NOZZLE: The wide mouth of the water storage containers make it easy to add ice cube, lemon or other fruits in your water, no need to lift the sports water jug bottle, just one click pop-up, the comfortable silicone nozzle and straw of the gallon water jug will inspire you to want to drink more water. It's even easier than ever to drink the perfect amount of water each day.  EASY TO CLEAN: The big water bottle comes with a clean brush that makes it easy to clean straw. Please simply wash the huge water bottle with baking soda and vinegar. NOTE: Do Not Drop Bottle, Not Dishwasher Safe, and Not Hot Liquid.  WORRY-FREE WARRANTY: Our daily water intake bottle supply a money-back and free replacement in 30 days, and our friendly customer service professionals are always standing by our sports water bottle. If you have any problems after receiving the water jug or in use, please feel free to contact us, we will reply to you within 1 working day and give you a satisfactory answer.", "price": "22.73", "currency": "$", "product_rating": 4.5, "availability": true, "shipping": true, "delivery_date": "Saturday, January 25", "delivery_cost": "0.0", "warranty": true, "image": "https://m.media-amazon.com/images/I/419968kVpDL._SS75_.jpg", "latest_reviews": [{"reviewTitle": "Stay Hydrated this summer!", "reviewText": "Very good quality water bottle I have recommended to so many people it’s not a cheap plastic it’s very strong and easy to carry and easy to clean. You can get your water intake for the day it has written on it for reminder", "rating": 5.0}, {"reviewTitle": "Great product", "reviewText": "High end quality. Will last for years", "rating": 5.0}, {"reviewTitle": "Must have", "reviewText": "Very good quality water bottle I have recommended to so many people it’s not a cheap plastic it’s very strong and easy to carry and easy to clean. You can get your water intake for the day it has written on it for reminder", "rating": 5.0}, {"reviewTitle": "Helpful bottle", "reviewText": "This is as displayed in the photo. Great to help you hit you3 dqily water consumption. My only issues is after awhile it has that rubber smell.", "rating": 4.0}, {"reviewTitle": "Good Quality", "reviewText": "Love the colours! Good quality and great size!", "rating": 5.0}, {"reviewTitle": "Great bottle", "reviewText": "Love the size of this and the difference lid options!", "rating": 5.0}]}