{"product_url": "https://www.target.com/p/heinz-tomato-ketchup-32oz/-/A-14651428", "product_name": "Heinz Tomato Ketchup 32oz", "description": "Heinz Tomato Ketchup is made only from sweet, juicy, red ripe tomatoes for the signature thick and rich taste of Americas Favorite Ketchup. Did you know that every tomato in every bottle of Heinz Ketchup is grown from Heinz seeds? Grown not made... One reason why nothing else tastes like Heinz! The thick texture makes our ketchup perfect as a topping or for dipping. It's gluten free and great for those keeping Kosher to fit your preferences. Reach for our ketchup at every cookout to top your favorite burgers, hot dogs and fries. Packed in 32-ounce ketchup bottles for easy sharing, this condiment is your go-to option for gatherings and everyday meals.", "price": "4.99", "currency": "$", "product_rating": 4.8, "availability": true, "shipping": true, "delivery_date": null, "delivery_cost": null, "warranty": false, "image": "https://target.scene7.com/is/image/Target/GUEST_a43f30dc-9d96-4399-825e-bd2e900f713a", "latest_reviews": [{"id": "7c2dbea6-dc06-448b-a8ac-57ba057d27ff", "text": "Heinz Tomato Ketchup is just great! We always keep buying this again and again.", "author": "Jenny", "title": "Great quality and taste!", "rating": 5}, {"id": "2626cc01-f3cf-4a69-ae4b-29fbc7788866", "text": "Using for many foods and snacks it’s simple and delicious addition to meals and snacks from tomatoes. I keep it in my refrigerator. Plastic bottle with a nozzle. Convenient. Affordable. Could recommend.", "author": "anniep58", "title": "Affordable tomatoe ketchup", "rating": 4}, {"id": "71402012-e4b1-41a9-a144-dae641cbab2a", "text": "Honestly, this one is a no brainer. Heinz Ketchup is a staple (and should be) for any household! Burgers, fries, hot dogs, you name it! Absolutely love it!", "author": "fires1", "title": "Heinz Ketchup. The One to Rule Them All", "rating": 5}, {"id": "060a741e-2a61-4365-aa2a-72e15b6c4716", "text": "This is the only ketchup that we have in our house. The best tasting ketchup is Heinz. It's easy to squeeze and always good to the last squirt. It can be pricey, but the flavor is worth it.", "author": "cristym35", "title": "Heinz, please", "rating": 5}, {"id": "95a0a624-fecc-409b-acd6-e3a6164b37f6", "text": "Packaging is good and convenient. The consistency is thick and not runny. The taste is very good, I can always tell when the ketchup I’m eating isn’t this brand. The others taste Kind of sour.", "author": "samanthall1", "title": "the best flavor", "rating": 5}, {"id": "0060853a-ce60-4471-8387-2aeebcc9eda3", "text": "Best ketchup! Heinz has the best tasting ketchup. Rich in tomato flavor and nice and thick to stay on my hot dog. I love the easy squeeze bottle, no more banging the bottom of the bottle", "author": "karenl344", "title": "The best", "rating": 4}, {"id": "08952db2-ae2c-4a6d-b85a-29e36698eb1a", "text": "Our classic ketchup is made only from sweet, juicy, red ripe tomatoes for the signature thick and rich taste of America's Favorite Ketchup Our classic ketchup is made only from sweet, juicy, red ripe tomatoes for the signature thick and rich taste of America's Favorite Ketchup", "author": "mylar1", "title": "Our classic ketchup is made only from sweet, juicy, red ripe tomatoes for the signature thick and rich taste of America's Favorite Ketchup", "rating": 5}, {"id": "30d2bdcb-3f7f-4653-9a50-ebb885b75c97", "text": "packaging is simplistic, taste and consistency is great. you can use ketchup with so many foods. good price point! best ketchup on the market!!", "author": "shaynal10", "title": "best ketchup out on the market!", "rating": 4}]}