{"product_url": "https://www.amazon.com/Tomatoes-preservatives-Artificial-Così-Comè/dp/B0CHL2HGKR", "product_name": "Italian Yellow Tomatoes Ketchup, made with 100% Italian Tomatoes, 9.88 oz (280 gr), No preservatives, No Artificial Flavors, Non GMO, Così Com'è", "description": "Authentic Italian Yellow Tomatoes: Elevate your culinary experience with Così Com'è Italian Yellow Tomato Ketchup. Crafted exclusively from 100% Italian yellow tomatoes, it brings the vibrant taste of Italy to your table.  Generous Size, Abundant Flavor: Each 9.88 oz (280 gr) bottle is packed with the exceptional flavor of Italian yellow tomatoes. This versatile condiment adds a touch of Italy to your favorite dishes, from fries to sandwiches.  Pure and Natural: We're committed to preserving the natural goodness of our ingredients. That's why our Yellow Tomato Ketchup contains no preservatives, allowing you to savor the authentic taste of sun-ripened Italian tomatoes.  Free from Artificial Flavors: Enjoy the real essence of tomatoes without any artificial additives. Our ketchup is devoid of artificial flavors, ensuring a genuine and satisfying tomato experience.  Non-GMO and Così Com'è Excellence: Our ketchup stands out for its commitment to quality. It's Non-GMO, reflecting our dedication to using premium ingredients. With Così Com'è, you're getting the best of Italian flavors, pure and simple.", "price": "8.99", "currency": "$", "product_rating": 4.5, "availability": true, "shipping": true, "delivery_date": null, "delivery_cost": null, "warranty": false, "image": "https://m.media-amazon.com/images/I/414ZwaY5xzL.jpg", "latest_reviews": [{"review": "IT has a kick I can't really explain that makes it different from regular ketchup  but also makes it taste good", "rating": 5.0}, {"review": "It was delicious and without additives", "rating": 5.0}, {"review": "Love the light-ness of this ketchup!", "rating": 4.0}, {"review": "Just received this and tried it. Due to zero preservatives this is the perfect size to use quickly. No lousy additives like our red stuff in the US. You won't be disappointed!", "rating": 5.0}, {"review": "Will purchase again!!! Worth the price!!", "rating": 5.0}, {"review": "It didn’t have much flavor.", "rating": 3.0}, {"review": "I just loved the taste. It was sweet, but not too sweet and tart, but not too tart. It tasted like Italian heaven...!", "rating": 5.0}, {"review": "I love this as an alternative.  The super fresh taste compared to common ketchup is fabulous (although I love that too).  I mix with mustard sometimes (3 peppercorn mustard to be exact).", "rating": 5.0}]}