{"product_url": "https://www.target.com/p/woodstock-organic-tomato-ketchup-case-of-12-20-oz/-/A-90209918", "product_name": "Woodstock Organic Tomato Ketchup - Case of 12/20 oz", "description": "The Woodstock Organic Tomato Ketchup is a case of twelve 20 oz bottles of delicious and flavorful ketchup. Made from high-quality organic tomatoes, this ketchup is perfect for adding a tangy and sweet taste to your favorite dishes. It has a smooth and thick texture that spreads easily, making it ideal for dipping, topping burgers, or adding to sandwiches. The rich red color and robust flavor of this ketchup will enhance the taste of any meal. Whether you're enjoying a classic burger or indulging in some crispy fries, the Woodstock Organic Tomato Ketchup is a must-have condiment for any kitchen.", "price": "70.49", "currency": "$", "product_rating": "4.0", "availability": true, "shipping": true, "delivery_date": null, "delivery_cost": null, "warranty": false, "image": "https://target.scene7.com/is/image/Target/GUEST_253a544e-f765-4fb6-a75c-73ab94182eca?wid=800&hei=800&qlt=80&fmt=pjpeg", "latest_reviews": [{"id": "3e3b181b-d4eb-4ac6-9bf1-ae07b8157d3c", "text": "Ran out of gallon tomato sauce to make ketchup so grabbed this bottle of ketchup. Slightly sweeter than my homemade but good organic stuff. (Now use tomato paste to make ketchup.)", "author": "DarleneC", "title": "good ketchup", "rating": 5}, {"id": "ffc80a53-e611-40da-ac97-cbc18b78b0ab", "text": "This is the best tasting organic ketchup I've found. I was having trouble finding it in stock on other sites, so I got three.", "author": "RonnieCal", "title": "Best Tasting", "rating": 5}, {"id": "37573995-dddd-4356-b856-405cd7193f23", "text": "I personally didn't like this ketchup because it is too sweet. It is also more liquid than I am used to in other products. I wouldn't buy this again.", "author": "BOWCOW", "title": "Extremely Sweet", "rating": 1}, {"id": "750354d2-80b9-4499-81dd-f5fce2fb5473", "text": "An organic catchup of a good recipe is hard to find until now. Thanks*", "author": "Birches", "title": "Wdstk catchup", "rating": 5}]}