{"product_url": "https://www.amazon.com/melii-Spikey-Water-Bottle-Straw/dp/B0B5S3TDQM", "product_name": "melii Spikey Kids Water Bottle with Straw, 17oz (Pink)", "description": "BPA free, Lead free, PVC free, Cadmium free Great for fidgeting and sensory exploration Easy to clean and top rack dishwasher safe Food grade silicone sleeve Bottle is break-resistant, durable, non-toxic, quality Tritan, which is odor, scratch and shatter resistant. Wide mouth makes filling easier Easy to sip straw", "price": "26.99", "currency": "$", "product_rating": 3.5, "availability": false, "shipping": false, "delivery_date": null, "delivery_cost": null, "warranty": false, "image": "https://m.media-amazon.com/images/I/31Hw8IaHeiL._SX300_SY300_QL70_ML2_.jpg", "latest_reviews": ["Great size bottle for our toddler - love the little \"ring/hook\" that her fingers can grab onto and carry herself.Silicone spikes is different and keeps my toddler interested with texture. The silicone bottom also makes more durable when dropped by said toddler.Day 2 of daughter using it and she's definitely drinking more water than she normally does! Clear bottle helps them to see how much they're actually drinking which is a bonus.The straw is soft silicone which is nice vs a hard plastic straw. Overall daughter is loving it.", "This water bottle is great for my toddler, the spikey design makes it fun and unique! It is easy to grip for toddlers. It is a great size as well and light weight. The material feels very sturdy, good quality!!", "My daughter loves it, it entertains her so much that it gets her to drink even more water! I throw it in the dishwasher and it's clean!", "My 4 yrs old daughter fell in love with this water bottle as soon as we unboxed it. There are many things we like about it:- Lightweight and easy to grip- Vivid/Fun pink colour- The soft spikes make it playful- Easy to cleanNow, the disappointment we have with this is the design of the mouthpiece/valve. It's not easy for the little kid to open it without touching the mouthpiece. It is easy for little kids to pull with their fingers from the part where they will drink the water from. In comparison, other water bottles we have all have the one-button push-open design so the kid would not be touching the straw/mouthpiece with hands directly. Look forward to a future iteration of this product."]}