{"product_url": "https://www.amazon.com/A5-memobottle-750ml-designed-BPA-free/dp/B07F3Z7QVR", "product_name": "memobottle A5-25oz (750ml) - Slim Water Bottle for Bags, Beside Books & Laptops | BPA Free Tritan | Modern & Minimalist", "description": "CARRY WATER CONVENIENTLY: A reusable bottle so convenient you'll never leave it at home. The Memobottle's space-saving and paper-shaped design allows for a sleek Tetris-style fit in your bag, flat against your books, laptop, and more. ULTRA-LIGHT AND BUILT TO LAST: The Original Memobottle is made from Tritan Plastic (BPA-Free, Freezer-Safe, Light-Weight, Clear and Transparent). It features a Stainless Steel Lid with a durable and reliable Leak-Proof Silicone Seal. The Memobottle can handle both hot and cold temperatures. THE PERFECT GIFT: There's space for a flat water bottle in everyone's bottle collection, making it the perfect gift when you need something both beautiful and practical. It arrives in a premium, recyclable & aesthetic gift box, making it easy to wrap, and a delight to receive. A unique, simple & modern gift. 2-YEAR GUARANTEE: We stand behind our products - that's why we offer a comprehensive two-year manufacturing warranty. OUR PURPOSE: Since 2014, Memobottle has been on a mission to make reusable water bottles more convenient, helping you live sustainably and reduce your consumption of single-use products. Also, every Memobottle sold provides 5 months of clean water to those in need, via our partnership with Water.org. DIMENSIONS: 0.37lb 9.6 x 5.8 x 1.2 in 170g 243 x 148 x 30 mm", "price": "39.00", "currency": "$", "product_rating": 4.4, "availability": true, "shipping": false, "delivery_date": null, "delivery_cost": null, "warranty": true, "image": "https://m.media-amazon.com/images/I/51CpWmZ-i8L.__AC_SX300_SY300_QL70_ML2_.jpg", "latest_reviews": ["A real conversation starter. First I have to explain there is no booze because it looks like a flask. That gets everyone going. It fits easily in my small purse stores nicely in the fridge and is sturdy.", "I love this it saves me so much space it’s like it’s not even in my bag and holds a good amount of water doesn’t not leak at all easy to carry", "Cute and easy to carry.", "It is very useful for my city trips, easy to store in my cross bag. The biggest flop for me was when opening the box to find out it wasn’t glass. It’s sturdy enough and light. So the price is a little over than what I was getting. But hey, I wasn’t complaining when I needed some water on my walks. It carries enough for a 5k walk for me.", "I’m one of those rarely-leaves-a-review type folks, and was definitely skeptical —especially because of the price— but it just came today and I’m already in love. I’m unsure how the company landed on its 750ml/25 oz, but I like to know things for sure. After using a measuring cup to fill this to the brim, I was delighted to learn my guy actually holds 32oz. I’m a singer, so a water bottle is usually always in reach, and I love when one holds enough that I don’t have to think too hard to know I’m getting enough water throughout the day. Two of these a day, maybe 2.5 is all I need to know I’ve done my hydrating duty lol. Love the metal cap, plastic is sturdy but still a little malleable; no leakage so far. I almost bought the slim because I have small hands and wondered how big this one would be. I also like the look of the slim one better (for real, why can’t the cap be centered on the bigger ones too?!), but with it seemingly only holding 15oz (could be more now that I know mine is), wasn’t worth it. Quickly got over the corner cap with this, though, because it’s no bigger than a standard book, I can hold it to water capacity with ease, and it fits seamlessly into my messenger bag, leaving a small footprint. You won’t be disappointed!", "This was the most convenient water bottle I've used while traveling. It fit easily into my pocket, and held just enough (I did refill it regularly). Though it cost a lot, was worth it as we hoofed around London. The only odd feature is that when you take it out for a sip, it looks like a vodka bottle!", "$23 for a 6oz reusable plastic water bottle seems a bit steep, but I decided to give it a try and got two -- one for me and one for my husband. My husband likes to store a small water bottle in the large pocket of his cargo shorts, often creating a pocket bulge which would look a bit off. This water bottle solves that. But it holds too little. We discovered a 500mL Fiji water bottle (which has a square base vs a rounded one) was also better at not creating a bulge that cylindrical bottles tend to create. Other criticisms is that he found it took too many twists or turns to open and close the bottle (whereas a standard water bottle takes less time to open and close); and the bottom of the bottle isn't quite flat, so it didn't have a good base to stand upright and would easily fall flat as a result. ... Although it's a decent size for a small sling bag or waist bag, which is nice. But I would've preferred to see at least an 8oz or 500mL option.", "I was surprised by how much it looks like it's made of glass! I love the look. Strong plastic. It's the perfect size to fit in my handbag, and I'm so glad that it can be easily washed in the dishwasher. At first, it did have a kind of chemical? Smell but after I washed it, the smell was gone, and I'm sure it's safe to use.", "El envío se realizó rápido y correctamente.Es de materiales buenos, lo único que no me gustó es que no viene con su funda, se ralla fácilmente y el asiento no es plano, no puedes dejar la botella parada.", "I was “influenced” when buying this water bottle, mainly because it is a different design than others! I travel a lot for work, and this week I had my first trip with the A5, and it was great! Fits in my bag, is lightweight, holds a good amount of water, and fits into the airplane seat pocket really well that it isn’t in the way of impeding any leg room! It’s a little pricey for what you get (plastic water bottle), but I think it is very worth it. Will I try it with hot liquids? Probably not. But for basic water needs, 5 stars.", "Arrived on time with no issues. Thank you", "Good quality and perfect size to fit in sling bag. Transperant look is ideal. No water leakage. Easy to carry. But costly.", "Ok"]}