{"product_url": "https://www.amazon.com/Pyrex%C2%AE-Changing-Bottle-Silicone-Coating/dp/B09FFQPVLN", "product_name": "Pyrex 24-Oz Color Changing Water Bottle with Silicone Coating, Leakproof and Textured Glass Reusable Bottle with Flip-Top Lid, Eco-Friendly, BPA-Free, Abstract Lava", "description": "REUSABLE & RELIABLE: The Pyrex 24-oz bottle is a hygienic glass bottle with shatterproof 5-layer silicone safety wall. The leakproof lock cap makes this reusable bottle perfect for your work bag, gym bag or for the kids to use to take to school. ECO-FRIENDLY & HEALTHY:This reusable water bottle is eco-friendly as it is made from BPA free material. Carrying a reusable bottle to work or school encourages you to stay hydrated and is easy to refill throughout the day. COLOR-CHANGING: Style and technology blend seamlessly in this 24-oz water bottle. Fill it up with cold water and watch as the bottle comes to life with vibrant colors that will make your day. ON-THE-GO: This Pyrex water bottle is ready for any occasion. Whether you're commuting, working out or simply taking a walk, this bottle is there to assist with its leakproof, flip-top lid and handy carry handle for easy drinking throughout the day. HIGHLY FUNCTIONAL: The Pyrex reusable water bottle has a break resistant outer body and can be used for a variety of beverages including water, sports drinks, juice, or even tea and coffee. It is also easy to fill and clean, for quick refills. A TRUSTED BRAND: Loved for generations, experienced cooks and beginners alike have reached for Pyrex brand glassware products, because they’re affordable, durable, and great for all their cooking, serving and storing needs.", "price": "19.00", "currency": "$", "product_rating": 4.2, "availability": true, "shipping": false, "delivery_date": null, "delivery_cost": null, "warranty": false, "image": "https://m.media-amazon.com/images/I/51PrIZFXryL.__AC_SX300_SY300_QL70_ML2_.jpg", "latest_reviews": ["Firstly:I love that I drink out of glass from the mouth/opening and not plastic or silicone!Now most importantly:Please read the instructions on how to (easily) open and close the lid, it’s the best lid ever! This is a slim grip-one handed only opening bottle! You just slide the button up and press the lower half of the tab and it opens! Think of it this way, open is to up as close is to down (like opening the window up, shutting the window close, switching lights on and off, etc). Then when you’re ready to close the lid, simply slide the tab back down and close the lid, ALL DONE WITH ONE HAND! You don’t have to close it then lock it so this is brilliant for all of us who quickly close our containers and forget to lock it bc that’s when most accidents happen! I think the poor scores are by people (this was aimed at kids apparently and we all know how impatient and rough kids are with things bc we all were kids once) who messed up the button/tab by forcing it the wrong way. Also, I wouldn’t just toss this around in a bag, I’d still put it in a designated bottle holder/strap it down…I wouldn’t give this item to kids unless they’re mature enough to treat it with care and also it’s a good idea to put it in a padded bottle sleeve as an extra cushion. Just bc a company or a guy off the street tells me “this is totally going to work for a child, even though you know that it’s x, y, z” I’m not going to blindly believe them, so parents..TEST THIS OUT FOR YOURSELF before handing it over to your kids.On to the next claim, the whole shatterproof one, to me (and this is just from reading it at face value) this means more so that when it does get damaged from a fall (it’s glass people) it stays intact more so than other glass products bc of the silicone coating and type of glass. If it tumbles onto a thick carpet or a thin/medium rug with a rug pad underneath, it should hold, if it’s concrete, tile etc, though don’t be surprised when it breaks…Common sense ain’t common, so…Now to the fun stuff:The color change is significant! I used cold water from my fridge and it morphed like a chameleon or octopus with bright fun hues! I know some people are party poppers (jk) claiming it’s a gimmick that’s not functional, but hey, it’s neat to me! Oh, and the softness of the silicone coating makes it a pleasant experience to hold rather than a rough or slick surface like other types of bottle materials (stainless steel with or without textured coatings, ceramics, rubber sleeves, glazes, etc). Additionally, I don’t feel like my grip will ever loosen unless I remove the coating, and I ain’t doing that lol. Lastly, it’s simple and easy to clean. Because it’s intended for cooler liquid temps, I do not put scolding hot water on or in it, I use lukewarm water and hand wash it bc I tend to keep my dishwasher on heavy/high heat, would not want to have the lid warped for instance (which happened to my Ello glass Syndicate lid but that was a good thing bc I dropped it so the heat somehow molded it back so it’s leak proof again, ok but this bottle and top beats Ello’s glass bottles except in the size department, wish Pyrex kept this design and added a few ounces)! Ok, back on track..I air or towel dry and wait till it’s room temp to pour ice cold water or place it in the fridge for a while and then fill it up (if my filter was on the counter I’d pour room temp in it then store it in the fridge).Reminder: if this has been sitting out in the sun, left in a car during a warm day, please do remember it’s GLASS, don’t quickly pour cold water in it, if you’re that thirsty just drink from the source of the water LOL (spout), bc idc if it’s Pyrex, better safe than sorry (and I own a ton of Pyrex glassware storage containers for kitchen usage from storage to cooking and even eating from the dish so I can skip the plate, lol).This was a long winded review, and I LOL’d a lot apparently, I need water now…Cheers!", "I bought this water bottle as an alternative to plastic resuable water bottles.  The silicone covering is a really nice touch making it more durable and easier to grip.  I feel confident dragging this to/from work and errands. The product claims to be shatter proof, not break proof-- it's glass...if you drop it off a counter onto a tile floor, basic physics will dictate it will break.  The nice feature is, instead breaking into a million pieces all over the place-- it will stay contained.  I liked this bottle so much I bought two more -- one for me and one for my sister.  I've used both bottles consistently for a few months with no issues.  I highly recommend!", "1.  The pop top can be tricky, but it really does work well once you figure it out.  Sipping can also be tricky, but if you screw the top off like other bottles, there is no problem; and the threads are in the ID, so no dripping.2.  Silicone coating has a nice feel to it and the bottle isn't slippery - good for people with arthritis.3.  Does NOT keep liquid warm, but it doesn't claim to.  I purchased it to carry my coffee in because it's glass and doesn't affect the flavor, and it fits really well in my tote/purse.  Coffee stays warm a little longer than conventional cups and not quite as long as coffee shop cups.  Most coffee mugs drip, spill and don't fit.Overall, these bottles are very nice.  I would purchase them again.", "I purchased two, the bottles are very cute, appear to be durable and feel great in your hands. The silicon coating is nice because some glass bottles have a full silicon sleeve which is a pain to take off to clean, whereas this product has a soft texture to it while still showing the pretty glass. My only concern is the lids feel a little wobbly. Unsure on the durability for them but even if they were to break the glass itself is great and hopefully I can find a universal lid replacement should it come to that. It’s also nice because I’m not a fan of the stainless steel craze, but it seems impossible to find a bottle that doesn’t have a straw or a weird opening. The lids have a lock ability so keep that in mind, simply slide down and it locks the lid. To open slide up if currently locked and just push the button inward and it will pop open. Overall it’s a very cute product and appears durable. This could be a great item for the Pyrex line if the lids can be strengthened (again, the lids are fine and operable, could last forever for all I know)", "I'm not a fan of drinking out of plastic water bottles or the metal ones that everybody thinks are stainless steel. The metal ones will give off oxidized particles and of course even though the plastic says it's BPA. You don't know that for a fact unless you test the plastic. Glasses the way to go but that could also be suspect if they use lead in the glass. And remember most of these items are made in China. So who really tests the material they're using. These are  Pyrex. The rubber coated and very durable not a fan of the design but the function is fantastic. The seal on the top of the bottle can be pulled off and periodically cleaned. Because sometimes you will get some funky growth behind it. The seals also made of a high quality silicone because anything that grows on the back of it will not embed itself into the silicone. The lock feature is a nice feature. And a durability of this thing is quite surprising due to the fact it's made out of Pyrex and the thin silicone coating really work well together to keep it from breaking. I should know I drop things all the time and these fell down a set of concrete steps and nothing happened to them. And at this price point stock up.", "This is my all time favourite water bottle and I have tried MANY! This bottle is glass and I've dropped it many times with no issue! I have had one for several years and bought a second one to have a work too. You will not want any other water bottle after trying this pyrex one!", "Pros*glass*doesn’t leak (yet)*fits in cup holder in carCons*the lids don’t open properly (sticks and must be forced. Little button thing is just decoration basically)*there’s no way to ensure the lid is locked.*unable to swig from container bc the lid doesn’t go back far enough and no straw provided. When you bring the bottle to your face the lid hits my face/glassesI got two of these and I was so excited but they are awkward.The hinge and locking mechanisms are huge potential points of failure.", "I do like this bottle but it has one annoying problem - the straw does not stay attached to the lid all that well. Otherwise, a near-perfect addition to your workout.", "Me parece hermosa y más cuando cambia de color con el frío. Muy práctica su asa para transportar. Su único inconveniente es que me parece pequeña para mí, que soy adulto. Pero hasta ahora le doy un diez."]
}