{"product_url": "https://www.amazon.com/Gaiam-Bottle-Wide-Mouth-Stainless-Aubergine/dp/B07QBZZCBB", "product_name": "Gaiam Water Bottle Wide-Mouth Stainless Steel, Aubergine Swirl, 18 oz", "description": "WIDE MOUTH WATER BOTTLE: Skillfully designed non-toxic, BPA-free 18 oz. wide mouth water bottles DOUBLE WALLED STAINLESS STEEL: Crafted from 18/8 double walled stainless steel to help keep your beverages either hot or cold NO-LEAK VACUUM SEAL: Water bottles feature a no-leak vacuum seal and a non-sweat construction so the bottle will not condensate or leak WIDE MOUTH DESIGN: Allows for quick refreshment with a wide mouth opening large enough for standard ice cubes TEMPERATURE REGULATED: Water bottle keeps your beverages refreshingly cold for up to 24 hours, or pleasantly hot for up to 12", "price": "12.99", "currency": "$", "product_rating": 4.5, "availability": true, "shipping": false, "delivery_date": null, "delivery_cost": null, "warranty": false, "image": "https://m.media-amazon.com/images/I/81Bw5Tc1E7L.__AC_SX300_SY300_QL70_ML2_.jpg", "latest_reviews": ["I like the wide opening, no straw, thus making it easier to clean. Purchased for my teen to take to summer work on a farm. Put cold water in the thermos and water stayed cold all day even though temps were in the high 90’s.", "I love the wide mouth so I can easily put ice in my water bottle. I love the handle so I can easily carry it.  I love that it carries 18 oz of water so I have plenty of water to last through the day.  The design is prettier than it looked online.", "This is my second time purchasing this water bottle. I used this bottle every day all day for a year, but eventually lost the lid and  had to replace it. This bottle meets all of my needs. It is large, the stainless steel keeps my water cold all day (even with the lid off) and its lovely. No straw, which I personally love, but wide mouth for easy drinking. Bonus a carrying handle. I don't plan to switch until this bottle lets me down.", "I bought a second one because they are that good. Super durable, keeps your drink hot or cold for hours. I've started the day with ice in my water and ended the day with ice still in the bottle. Wide mouth makes it easier than others to clean", "I love these water bottles. I decided to get bottles that would all work together (so all the kids would work with all the bottles) and these are my absolute favorite kind. They can go into the dishwasher. The handle makes them easy for the gym, hiking, or yard work. With a little ice, they stay nice and cold. I like the wide mouth opening for drinking ease.", "Dishwasher safe and doesn't leak.", "I received my water bottle yesterday and immediately put it to use . I love the print on this water bottle!!  And what a bargain!!!So far I have been very very very pleased with how well insulated this is. Had ice water in it all day and the next morning my water was still nice and ice cold. I have not experienced any metallic taste as other reviewers had. (Sorry that has happened to you guys.) I did take one star off ONLY because my lid came broken, the handle did not fit in the holes on the lid. But to be completely honest, while ordering this I knew right away I was not going to use the lid it came with. I have several water bottles and therefore several lids that are superior to any other water bottle lid. I prefer a straw lid. But for people who will use the provided lid, be aware you may get one like mine. As of yet I cannot say how durable the bottle is....but it did take a couple falls/drops today during our trip to a museum today and there are no dents or scratches!!", "I bought this bottle because I liked the palm leaf design but it is going back. It doesn't keep water cold. I filled it with ice cubes at night and they totally melted overnight.  The handle is shaky and rattles - it feels  like it wants to break off.  The cap comes off track very easily making it get stuck frequently.", "I have two of these now (one in each size), and they are the best I've found for keeping water cold. I fill it in the morning with about one third ice, and by the end of the day there is still ice in the bottle even after refilling it through the day.My only complaint is that sometimes the handle comes off, but it's easy to pop back on.", "I like the fact that having it helps me to drink more water.  I have had other  aluminum bottles before but they had the metallic taste that was off putting for me.  This one does have that."]}