{"product_url": "https://www.amazon.com/Nalgene-Narrow-Mouth-BPA-Free-Bottle/dp/B000LGZW8S", "product_name": "Nalgene HDPE Narrow Mouth BPA-Free Water Bottle, 16 oz", "description": "Made from HDPE (high-density polyethylene) these bottles are very lightweight and durable making them great for backpacking For Your Everyday Adventures! Take your Nalgene bottle to the gym, office, camping, exploring and everywhere in between This Nalgene water bottle is completely leak proof, made of virtually indestructible BPA-free Tritan, easy to clean and dishwasher safe on the top rack 100% waterproof, One handed closing technology for quick and easy drinking Customize your Nalgene with different colored lids.Whether you're looking for a virtually indestructible water bottle for a backcountry adventure, or you want a clean, green way of storing your dry pasta, you'll find a Nalgene product that gets the job done.Nalgene is a proud part of Thermo Fisher Scientific, for 70 years Nalgene has been making a wide range of BPA/BPS free reusable water bottles and containers to suit your personal preferences, needs and lifestyle here in the USA", "price": "9.99", "currency": "$", "product_rating": 4.8, "availability": true, "shipping": false, "delivery_date": null, "delivery_cost": null, "warranty": false, "image": "https://m.media-amazon.com/images/I/61VuhGH6bHL.__AC_SX300_SY300_QL70_ML2_.jpg", "latest_reviews": ["I like this water bottle a lot!  It is a good size, easy to fill, opens and closes easily, convenient to carry, and has a secure lid so I don't have to worry about spilling.", "I love this water bottle. I don't like the wide-mouth Nalgene water bottles because when I go to take a sip I always spill it down myself. It's not the bottle's fault it's probably because I drink liquids in moving vehicles. This one is just perfect I have not spilled it once. It's easy to clean so it doesn't build up germs and fits in every cup holder and backpack pocket. I give it a five star. I will be repurchesing if I ever need another one for any reason.", "I use this as an alcohol fuel bottle for trangia style burners. It has volume markings on the side, holds enough fuel for maybe 4-5 full burners (I always refill it after a few burns so I haven't confirmed), is completely leakproof, widemouth with a lip that pours well without spilling and is easy to refill. Really solid cylinder there is no concern of this getting broken in a pack. I'll definitely be buying another, no point in using one of the specialty fuel bottles that dent easily, you can't see through, and cost way more", "I’ve had my 32oz standard wide mouth Nalgene for 10 years and i still gravitate to it over our various Yeti, Kleen Kanteen, and HydroFlask metal options. It’s significantly lighter, which is where most of my preference lies (this also keeps me from purchasing a glass bottle, which would be environmentally superior, but alas). Full of water, though, the 32oz Nalgene is NOT light and it also doesn’t fit in my car cupholders, which isn’t really a big deal, but i started considering a 16oz option to take in my purse, in the car, on errands, dr’s appt’s, etc where i might just like a couple gulps here and there but certainly don’t require a survivalist’s h2o stash.I purchased the ultralight 16oz narrow mouth Nalgene for these purposes and am pleased with the size for such. Some people have been posting about it looking child-sized but without really helpful photos, so i’m providing a couple comparing to:Standard mug32oz glow in the dark wide mouth Nalgene16oz ultralight narrow mouth NalgeneKid’s Kleen KanteenStandard Yeti pintKid’s Camelbak Edy+I would liken the 16oz Nalgene to holding a Fiji bottled water— a little more substantial than a Deer Park or Nestle bottled water, but only slightly so.My bottle also had NO strange smell or taste, so that seems to be hit or miss regardless of vendor.Regarding the ultralight weight, it’s maybe noticeable to a nuanced hand when empty, but at this size, you’re not going to notice much relief in weight when full. This option is roughly half the price of the cutesy colored options though, which sealed the deal for me.", "It's hard to find water bottles that aren't giant! This size is perfect for kids backpack or taking in the car etc. Less water goes to waste. They are so durable! The cap with ring means you don't lose the cap and you can attach it to a backpack or bag. Fits in the bottle holder on the bike. Does not have any weird plastic taste or smell. And I like the smaller neck for easier drinking with out spilling it everywhere like the wide neck models. Easy enough to clean even with the small neck if you simply get a bottle brush. I love these water bottles! Wish I'd discovered them years ago. I ordered another, and I think I'm going to order more so I can keep cold ones ready in the fridge to grab and go.", "This design hasn't changed in over 20 years; I know because I have one that old and just bought another one. It's not as pretty or sexy as many water bottles, but it's small enough to fit easily in my daily carry shoulder bag and office backpack, where many of the larger water bottles do not fit. Also, I don't drink enough between fill opportunities that I nee such a huge bottle. This simple bottle does the job and does it well, with no bells and whistles.", "This is the perfect size for your purse or car cup holder. Love Nalgene products and this did not disappoint!", "I recommend these bottles this brand and this particular item and model ....you can freeze them  and they won’t bust the contract and expand into shape .....Good for every day use and travel  good only for drinking water to keep cool if frozen  ...... they even come in handy as an ice pack if no alternative ..,", "I drink water filtered from a Brita jug. Hence it is a bit difficult to fill the nalgene bottle from a jug because of the narrow mouth. Filling the nalgene bottle from the tap is fine though.My other 1litre nalgene looks a bit more sturdy, plastic is hard and thick. On this one plastic is soft and thinner.", "I got the smaller size, perfect for my everyday day. Best water bottle I've had really, it feels sturdy the lid attachment is very secure. The attention to detail in the design is great, there's a little notch for your lips. I didn't get any plastic taste at all from it!", "Super solid. Dropped it many times and it still intact. I like the narrow mouth on it, it's easier to drink from it.", "Fast shipping and great product.", "My daughter loves this little Nalgene to go with her full-sized one.  Nice to take on outing where the giant one isn't necessary"]}