{"product_url": "https://www.amazon.com/A-R-Sports-Water-Bottle/dp/B079LYYDJS", "product_name": "A&R Sports Water Bottle", "description": "Quart-plus water bottle Push pull cap Plastic Material From A&R Sports, the leading brand in sports accessories for over 20 years Quart-plus water bottle Push pull cap Plastic Material", "price": "12.89", "currency": "$", "product_rating": 4.5, "availability": true, "shipping": false, "delivery_date": null, "delivery_cost": null, "warranty": false, "image": "https://m.media-amazon.com/images/I/41o4qczcuUL.__AC_SX300_SY300_QL70_ML2_.jpg", "latest_reviews": ["This is by far the best sports bottle that we've purchased. As a lacrosse coach, I strongly recommend this type of bottle to all my players. The ability to drink with a helmet on, means that players can get off and back on the field faster, or finish a water break more quickly than boys who need to take off their helmet to drink from a standard water bottle. I also have no qualms letting my kid share his bottle, since it can be squeezed to drink instead of having to suck on the straw.The straw is pre-bent at the angle shown in the photo, the straw is barely flexible but this rigidity makes it easy to use through any type of helmet (lacrosse, football, hockey, etc) With the straw fully inserted into the bottle, there's about 6\" of straw sticking out. The plastic that makes up the housing of the bottle is also fairly soft. This makes is easy for smaller hands to still apply pressure to the bottle to expel the drink out the straw. (My 8 year old has no issue with it at all.)The water bottle won't drip when it has the cap on. You can leave it sideways or give it a squeeze upside-down with the cap on, and nothing will come out of the lid or straw. The straw is surprisingly tight in the \"lid-hole\". The lid is also ridged, which you can't really see well in the picture. This makes it easier for sweaty hands to be able to unscrew it.The bottle will hold 32 ounces when filled to the top of the straight section of the bottle-wall. It will hold 36 ounces when filled a mm short of the brim. (Pro-tip: when the bottle is really full, you can close it by gripping the bottle at the stiff part of the shoulder, instead of in the squishy middle. You can also remove the straw while screwing on the lid to keep from spilling drink out the top.)Regarding the smell: the two I bought didn't smell particularly bad when they came. But rubbing the bottles with a paste made from water and baking soda will get rid of the smell pretty quick. You can also let them sit overnight filled with water and a few spoonfuls of baking soda. Or, just let them air out naturally. I've had one of these for just over a month, and the other for several months and they both have zero plastic smell now.", "This is good for dek hockey.  The straw usually fits through the face cage on the mask so you don’t need to remove it to have a drink, and it’s not messy.Not the most durable bottle - I wait for a price that is acceptable to me knowing it won’t last more than a few months of regular use. The straw will usually end up splitting, the lid always gets lost, and the bottle will eventually crack. But, when I get one for a good price, this is fine for our purposes.", "Great little bottle. The material is very malleable and soft. I use mine in the shower for my hair....I live in an area with very hard water and fill this up with distilled to wash my hair. It squirts easily, holds quite a bit of water and is easy to hold.", "Nice, basic sports water bottle used by a lacrosse player.  It was inexpensive, so didn't expect much but it was better than others that we have owned.  The attachment for the straw top is good quality and did not break off on the first or second use like other sports bottles we had.  It is a thin bottle, which makes it very easy to squeeze.  We fill it to the top with ice, and a little water, and about mid game the water is still a little cool.  It's a sports bottle, so was not concerned about how well it insulates.  For the price, would definitely buy again, especially when...invariably, this one gets lost :-)", "I love this water bottle! I don't even use it just for hockey I use it all the time now.I love laughing at people struggling to unscrew the caps on their nalgenes and then spilling water all over themselves as the attempt to slurp down the torrent of water coming from the water main pipe sized opening. When I want water I just pop off the cap and sip. Simple and easy.I love watching people struggle to pick up the pieces of their shattered hard plastic water bottles or clean up the watery mess made after an open bottle is dropped. When my bottle falls it just bounces, the soft plastic absorbing the impact. The water stays in the bottle too because the cap never needs to come off.My only two complaints are:1. The black cap's holder that connects it to the straw broke. No fear though, a simple rubber band can be used to hold it on.2. Sometimes if the pressure inside the bottle is wrong or if you squeeze it too early you can squirt yourself. I find this to be a fun game though. It adds some thrill to the safe monotony of modern life. Plus I've figured out by blowing air into the bottle I can precisely control how easily water comes out when I sip on the straw. neat.In summary, buy this. Buy 2. Give one to your friend, your grandma, and your dog. If everyone used these water bottles the world would be a better place.", "I have two kids who play ice hockey and these were perfect.  They hold a really good amount of water that gets them through practice.  The curved straw also fits through their helmets quite easily.  Finally, the price was right as well.", "I see lots of other reviews complaining about the smell of this thing... While yes there was a smell when I first got it, and stuck my nose inside of it, I haven't noticed it at all ever since washing it out a few times, and using it.  Plus while I'm sitting on the bench drinking from the extended tip, I'm not trying to smell it - I'm trying to get a drink, and it does that part perfectly.  The extended tip is great for reaching through the cage on my helmet.", "Bottle is nice and soft. Great for playing goal with the extended spout. Will leak though when closed if the slightest pressure is on it.", "buena calidad y me.funciono bien para mis boxeadores", "It's really flimsy plastic, it's good for sports I guess but water comes out weird too. So if you try to squirt in your mouth it goes everywhere. So eh, there's better cheaper bottles at the dollar store.", "Son uses for football, great quality", "I use this for hockey and it's fantastic. I was worried when people said it had an odour that wouldn't go away but my bottle is perfect. I should have ordered two.", "Material is good, no leaks. For a six years old, it is not easy to drink, need to squeeze hard to make water out."]}