{"product_url": "https://www.amazon.com/CARA-Luxury-Rubber-Water-Bottle/dp/B0006NXPBC", "product_name": "Cara Luxury Hot Cold Rubber Water Bottle", "description": "Fill with hot water to remedy aches, pains and sports injuries or just to help get a good night's sleep Water Bottle is recommended for use when hot or cold applications Secure screw top stopper ensures no leaking Made from natural rubber; retains heat for an extra long time Comes with 10 year manufacturer's limited warranty", "price": "11.99", "currency": "$", "product_rating": 4.3, "availability": false, "shipping": false, "delivery_date": null, "delivery_cost": null, "warranty": true, "image": "https://m.media-amazon.com/images/I/81hkUUotswL.__AC_SY300_SX300_QL70_ML2_.jpg", "latest_reviews": ["Very high quality.  For cold, fill it with rubbing alcohol and put it and leave it in the freezer.  Stays very cold for a very long time when in use.", "I have try this product before and was glad I could find it again, it is wonderful, my \"best friend\"LOL", "The water bottle appears to be high quality.  However, the product details insinuates that it is an enema system, but there are no enema attachments included. That was somewhat misleading and disappointing.", "I received the Water Bottle and was very disappointed.  The bottle and cap themselves are probably good quality - but there were no attachments. I thought I was ordering the bottle with hose and all attachments for enema use, etc.  I think the product description was misleading.", "This is a review of a Cara 2 quart Water Bottle. On the box, it says \"Number 4 luxury.\" This is the third water bottle I purchased a little while ago in the process of trying to find a quality one. The first two were too cheap like in construction so I returned them.One one side, it is embossed decorative like and on the other side it has more of a smooth surface with a slight pattern on it. It has a lifetime warranty. If I were to need another water bottle this size, I would buy another.", "All I knew was that I wanted a water bottle, trying to get back to the basics and to save a little money in the process.", "I love this brand of hot water bottles. The heat really transmits and it feels soft against the skin, not hard and plastic-y. Plus there's one side with soft ribbing to keep it slightly away from the skin, and the other side is flat for more contact if desired. I used it daily for a year before it leaked, which is a lot of use. I'm very happy with this product and will buy it again.", "Just what I wanted. Perfect. Cramps, stomach ache", "One may call this old fashioned but I read the write-ups on manyand this one fit what I wanted.Just a good sized opening, well made, and a place in the bottom to putsomething to hang it by. I use an old shoelace.The 1 problem is that at the top while there is a spot for a hole it is notpunched out, It was easy enough to do with an awl.That way, using another shoelace the stopper can be attached to bottleand not be misplaced."]}