{"product_url": "https://www.amazon.com/Insulated-Stainless-Bottles-Leak-Proof-Caribbean/dp/B0CFFN124F", "product_name": "OLDLEY Insulated Water Bottle 12oz Stainless Steel Water Bottles with Straw for Adults Kids, Double Wall Vacuum Bottels, Leak-Proof Sports water bottle for School Travel,Caribbean Blue", "description": "【GUARANTEE By OLDLEY】: We provide a lifetime guarantee about all the lids. Any lids can be requested for a new one no matter if you do not like them or defective reason. Please contact us if any questions, we will be at your service anytime. 【18/8 Premium Stainless Steel 】 Our wide-mouth insulated water bottles are both made of food-grade 18/8 Stainless steel. It has the features of being 100% BPA-free, Leakproof, Odor free, Rust free, and sweat-proof. 【Double Walled Vacuum Insulated 】 Perfectly vacuum sealed with double wall insulation, our sports water bottle can keep beverages cold or hot for a long time. 【 Easy to Carry】Our insulated water bottle comes with a BPA-Free Leak/Dust Proof straw lid. A One-hand operated straw lid with a durable nylon handle for smooth flow and comfortable carry. 【Dishwasher Safe】Our metal water bottles can be easily cleaned by hand or in a dishwasher, ensuring effortless and convenient maintenance. Please note that the lid should not be placed in the dishwasher.", "price": "12.98", "currency": "$", "product_rating": 4.5, "availability": true, "shipping": false, "delivery_date": null, "delivery_cost": null, "warranty": true, "image": "https://m.media-amazon.com/images/I/81p4yBAb5dL.__AC_SX300_SY300_QL70_ML2_.jpg", "latest_reviews": ["I really like my new water bottle.  It holds a lot so I’m not refilling it all the time.  I know the straw-type units are popular now, but I like this one because the mouthpiece is protected by the flip-top cover, keeping it sanitary.  Opening is easy with the touch of a button.  The steel lining keeps things cold for hours and hours.  Durably made and good quality.  Good value for the money.", "I love this Tumbler, bought it for my toddler for preschool.She absolutely loves it.The modest build, easy to clean. No leaks.Its easy to hold, not slippery like most tumblers. Holds a great amount of liquids.This tumbler even featured a cool handle. The fact that it is insulated makes this product a 10.Looking forward to buying more.", "This is a nice, sturdy water bottle.  The pop top and straw work well.  A child could use it as well as this senior citizen.  It locks and unlocks easily.  And it does not leak!  I have the smallest size which is perfect for my needs.  One of the giant sizes might be too heavy for me, so keep that in mind when choosing the right size.", "I never thought I would ever need to buy another water bottle ever again. My first one, the blue one with the bear stickers, was perfect in every way. I have had it for a couple of years. I used it daily. Its always with me. I even sleep with it. However, it started to leak and I couldn't figure out how to just buy a new lid. So I broke down and bought Tina. She likes her rhinestones. I can't part with the other one just yet, so I'm trying to figure out what to do with it. I don't have the heart to just toss him to the curb :( wish I could get a new lid without having to buy an entirely new bottle. Doesn't seem very sustainable if you have to keep buying new bottles if the lid fails.", "Good quality bottle, no leaks, maintains temprature well. Great value for money.", "These have such beautiful color combos!  They are so easy to open with one hand.  Keeps drinks cold for a long time.  They do not leak.  They are a good value for the color choices.  They are also easy to engrave, making them perfect gifts.  Fairly easy to clean.", "I needed a water bottle just a bit smaller than the one I use all day. I slapped a bright sticker on this one and can take it every where. Fits in my car cup holder. Very sturdy", "First bottle the lock mechanism worked too much and it wouldn’t open so my kid stayed thirsty at school.  Second bottle my kid tells me it keeps leaking.  I think I have to go back to the original kid bottles.  The only positive is they come with cute stickers.", "Daughter loved it so good great size keeps things cold easy to clean", "Keeps ice frozen for around 4-6 hours, drink stays cold for at least a few hours after that.", "Garde au frais toute la journée et ne coule pas. Elle a une grande capacité, donc j'ai assez d'eau pour toute la journée. Elle est un peu loude, mais ça me va.", "These are my favourite water bottles for my kids. They are durable after many drops! My kids love putting stickers on them. Lasted the whole school year plus longer! Keeps water cold for them all day.", "This has become my emotional support water bottle that I bring with me everywhere. It keeps my water and ice cold for hours. It fits in cup holders. I love that it has a strap to make carrying it easier! Love the colour, it’s so nice."]}