{"product_url": "https://www.amazon.com/Nalgene-Tritan-1-Quart-Narrow-BPA-Free/dp/B001NCDE48", "product_name": "Nalgene Tritan Narrow Mouth BPA-Free Water Bottle, Gray, 32 oz", "description": "Thanks to the smaller opening of the Narrow Mouth less water can rush out, making it easier to chug mindlessly. For Your Everyday Adventures! Take your Nalgene bottle to the gym, office, camping, exploring and everywhere in between. This Nalgene water bottle is completely leak proof, made of virtually indestructible BPA-free Tritan, easy to clean and dishwasher safe on the top rack. Suitable for both warm and cold beverages (-40 to 212 degrees Fahrenheit). Free of BPA, BPS and phthalates; marked with milliliters and ounces for easy measurement. Whether you're looking for a virtually indestructible water bottle for a backcountry adventure, or you want a clean, green way of storing your dry pasta, you'll find a Nalgene product that gets the job done. Nalgene is a proud part of Thermo Fisher Scientific, for 70 years Nalgene has been making a wide range of BPA/BPS free reusable water bottles and containers to suit your personal preferences, needs and lifestyle here in the USA.", "price": "17.99", "currency": "$", "product_rating": 4.8, "availability": true, "shipping": false, "delivery_date": null, "delivery_cost": null, "warranty": false, "image": "https://m.media-amazon.com/images/I/61ockGp5TzL.__AC_SX300_SY300_QL70_ML2_.jpg", "latest_reviews": ["Great water bottles. They hold up. Hiking,fishing,hunting. They do scratch up pretty easy but we also aren’t delicate with these bottles. So you know they can stand up to being tested outdoors. Do not freeze with water, they will crack obviously. Color is true to photo. Love the hook on the lid, good for hooking onto things. Easy to grip. Size is great.", "Sometimes in life, you have to follow a certain set of principles. This water bottle purchase from Amazon allowed me to follow mine: Keep it simple.I bought this to replace a 3-month old Camelbak Eddy bottle that, despite a fancy bite valve and straw and 'leak-proof' design, leaked all over the place constantly. This bottle has no fancy features, no valve, no straw, no vacuum/hermetically sealed gasket design, no space-age materials designed to keep the H20 firmly inside the plastic until you want it in your mouth-hole. No sir. This has no such accoutrements.This has a cap. And a darn sturdy one at that. And it has a bottle, which is important, because you want to buy a water bottle. The bottle holds the water very well. The cap does an admirable job of keeping the water inside of the bottle, which is an important feature that high-tech gizmos don't do so well. So basically you've got a bottle, and a cap, and it holds water.Now lets get to the specifics: It holds water -- a liter of it, to be precise. It's got markings for ounces for us Yankees who are more geared to the 'standard' mindset, but this bottle is an international traveler! You want to go abroad? Nalgene's got you covered. No more will you wonder \"How many milliliters of water should I ask the waiter at this Paris cafe for? I really want 16 ounces of water, but I don't know how that converts!\" All you've got to do is look at the other side of the markings! Turns out 16 ounces of water is pretty much a half a liter or so, or 500 milliliters for those of you who never paid attention to the metric system/base 10 unit in 7th grade.The plastic is grey. Not like grey like a cloud, because you can't see through them very well. This thing is clear, but grey. It's like it's two colors that aren't colors at all. It's like a bad pair of sunglasses. This would make bad sunglasses because it wouldn't be comfortable to strap to your face. I tried. Not worth it.Oh, and it's BPA free, which means you won't grow extra arms from drinking out of it.The only drawback to this bottle is cleaning. It starts to smell a little funky after several refills if you're not washing it in between. Buy a bottle brush, or just toss some soap in with some water, swish around furiously for 30 seconds and call it good like I do.All in all, this is a great bottle that holds water, is capable of metric conversions, and can be cleaned. If you're looking for a no nonsense piece of equipment that will do these things, buy this Nalgene Tritan bottle. It's worth the few dollars they charge for it.", "100% satisfied with my Nalgene narrow mouth bottle.  For any who need clarification, the 1 quart size is the same as the 32 oz. It even has the approximate volume in ounces and mL.  For some reason the 1 quart model was cheaper so I went with it.  Anyways, the bottle itself is durable as expected and the color for the grey variation is spot on.  I've already dropped it, full of water, and there are no cracks or any other damage to the bottle or screw cap.  I carry the bottle by the plastic that connects the bottle to the cap, and it handled the weight without issue.  The narrow mouth bottle is awesome for drinking water on the go and prevents spilling on yourself, especially while walking, driving, or exercising.  Of course, it can be more difficult to fill up than the wide mouth version but it truly isn't that big of a deal for me.  For cleaning, you can purchase a bottle cleaning brush which is relatively cheap at most Target or Walmart stores, or use the old \"fill with soapy water and shake the heck out of it\" method.  Both work well.  It is also worth noting that your water will not stay cold very long in this bottle, definitely nothing like one of those newfangled HydroFlask bottles.  This is actually a plus for me since I highly prefer room temperature water, but it is good to keep in mind. I imagine ice cubes might be a pain to put in the narrow mouth, so if that's an issue for you I'd recommend to get the wide mouth or spend the extra $$$ on an ultra-insulated bottle.  Last but not least, the bottle is made in the good ol' U.S. of A.", "It's a Nalgene! Not much else to say. the small mouth makes it a little difficult to clean but the quality of these is second to none.", "Marca Referência no seguimento, melhor preço praticado no Brasil, pra quem gosta de atividades outdoor é um item indispensável.", "It was a very satisfying experience ordering a proven product. The product was genuine and delivery process was smooth and vert helpful. Looking forward to buying more of the same product as it has been very good. 5 Star for product and delivery.", "I have to admit, I never thought I'd be the person to pay over a tenner for a water bottle but this bottle has been beyond amazing! It's sturdy beyond comparison to any competition, even the plastic strap connecting the heavy bottle and lid is still intact after me carrying it around with it for years!Somehow it never smells other unlike other bottles I own which is weird, but they all get cleaned the same, so I'm going to put it down to the design!One tiny con is that, it is a wide 1L bottle therefore it might not fit in certain water bottle holders ie cupholders in cars, holders in treadmills, side pockets in backpacks etcIf you keep buying water bottles thinking awh this is my last bottle I'm buying, do yourself a favour and end the cycle with this bottle! It's professional / practical / 100% worth it!", "L'ho comprata per mio marito ed è rimasto contento. In realtà la voleva da un po'. Facendo crossfit e sudando molto ho scelto quella da litro. Facile da lavare, non fa' odore e la tecnologia è studiata per non sviluppare muffe. Ottimo acquisto"]}