{"product_url": "https://www.amazon.com/WATER-GO-Purifier-Filter-Bottle/dp/B093B5VLNQ", "product_name": "Water Bottle with Filter (25oz/75cl)", "description": "Protects from Dangerous Viruses - This filtered water bottle has a 3-in-1 filter to protect from viruses that most water filter bottles cannot filter, making it an ideal hiking water bottle, camping water bottle or water bottle with filter for travel. Protect the Planet – A BPA-free and recyclable water purifier bottle. One filter replaces 400 plastic water bottles. This filtered water bottle is a sustainable travel essential and camping essential for the eco-conscious adventurer. Long-Lasting Water Bottle Filter – One filter provides 53 gallons/200 liters of pure water - about 3 months with typical use - and replaces 400 single-use plastic bottles. A perfect water filtration bottle for hiking, camping, or survival gear. No Leak Guarantee - This water bottle with filter has a new lid design for no leaks - guaranteed! A leak-free filtering water bottle that purifies water in seconds as you drink while camping, hiking, or traveling. Independently Tested & Proven – Our purified water bottles are proven effective by 4 independent labs and over 500,000 customers worldwide. This filter water bottle provides safe drinking water perfect for both adventurers and everyday users. Compact, Durable, & Travel-Ready – Lightweight yet sturdy filtered water bottles for travel are perfect for any adventure. An essential travel accessory, hiking water bottle, or survival gear for safe emergency water anywhere, anytime. Fits most bike cages.", "price": "59.99", "currency": "$", "product_rating": 4.1, "availability": true, "shipping": false, "delivery_date": null, "delivery_cost": null, "warranty": false, "image": "https://m.media-amazon.com/images/I/51Ahq9VadEL.__AC_SX300_SY300_QL70_ML2_.jpg", "latest_reviews": ["I used this filter for a 10 day trip to India. I drank nothing but tap water filtered through the bottle for the entire 10 days and never had a problem with any sort of illness. I loved not having to use single use plastic bottles and knowing my water was safe. I can not recommend this bottle enough. It does require some squeezing to get the water flowing, but I would just use it to fill my Nalgene bottle.", "I got this for a trip to India and all the water I drank went through the filtration system in this bottle. A companion got sick for 24 hours during the trip from the filtered hotel water but with this water bottle, I had no issues. I wish it was insulated but filtered water was still wet and did the trick health wise.", "I bought the Water To Go Water Purifier bottle for a 100-mile hike less than a year ago. It worked perfectly then, and continued to work perfectly on my hiking trips until recently when I flipped open the lid and it broke apart. I was so upset! Then I contacted Water To Go and they said \"No problem! We'll send you a new lid immediately.\" I received the new lid within a few days. I was SUPER IMPRESSED with the attention they gave me.", "Bought this bottle for my dad since the water out of his tap tastes bad. So far the bottle works great. He uses it every day and the bad taste and smell is gone. He just wishes the bottle came in a bigger size, and he would give it five stars.", "No matter how many times I re-seated the lid or tightened it, the water almost always comes out the closure opening or the sides when squeezed into another bottle.  The gaskets look fine.  I squeeze slowly.  I give up on this product.", "The product was in good insofar as it filtered water which was awesome! But it constantly leaked all over me every time I drank it.That being said - I still give this product a 5-star rating, as it is my understanding that this issue has been addressed with future water bottles and this was the result of a defective batch that has since been corrected. Furthermore, the customer service was OUTSTANDING. Very happy overall.", "I was surprised by the material when I got this.  I thought it was going to be a rigid container, but it's a nice soft container (which now makes sense since you need to squeeze it to make it work).  It seems extremely durable and is light weight.  I almost wish now I got the larger one, but I'm thinking the smaller one will be better for travel and carrying along, etc.I didn't get to actually try it with dirty water though, so I can't speak to the functionality.", "This gives us great peace of mind when traveling for sports or camping! We never know the safety of the water source when traveling, and having this filtered water bottle is essential. I don't have to worry when my son refills his water what contaminants are in the pipes or the fountains. And we don't have to lug extra bottled water - just this Water to Go. I keep one in the car just in case!", "After doing much research and comparisons, I decided to place an order for an Active 26oz/75cl Purifier Filter Bottle through Amazon in January of 2023.This was to be a gift for a friend who was travelling to Merida, Mexico.Soon after I received an email from the manufacturer stating that due to some kind of \"integration error\", my order was not shipped expedited, but that I would receive my order shortly. Also, I would get a refund for the shipping charge, which was unexpected, but appreciated.Unfortunately, my friend left for her trip before I could give her my travel gift. Since I had no need for this product, I decided to request to return it the same day it was received.Shortly after this I received another email from the manufacturer apologizing that I did not receive the product on time and that they would provide me with a full refund. They also said that there was no need to return the bottle, and to keep it as a \"gift\".Surprisingly, I ended up going to Mexico to visit my friend and decided to bring the Water-To-Go water bottle along with me. This product was simply amazing! It was so easy to use, and the water tasted great (I did not get sick). I ended up using it every day, taking it everywhere I went. This bottle became my security blanket!Thank you Water-To-Go for not only having a wonderful product, but for your amazing customer service!", "I bought this for a trip to South America.  I filled the bottle in taps where the water was not potable.  It really works.  The filter kept me from getting sick and the water tasted good.  Highly recommend this water bottle!"]}