{"product_url": "https://www.amazon.com/Dopper-Water-Bottle-Pure-White/dp/B016WJ8VIU", "product_name": "Preserve Dopper Water Bottle, 15.25 Ounce, Pure White", "description": "Choose to drink from your Dopper as a bottle or as a carafe with a cup", "price": "19.75", "currency": "$", "product_rating": 4.1, "availability": true, "shipping": false, "delivery_date": null, "delivery_cost": null, "warranty": false, "image": "https://m.media-amazon.com/images/I/61F9ImMTaJL.__AC_SX300_SY300_QL70_ML2_.jpg", "latest_reviews": ["This is a really well designed product. I love that I can open it both ways, and the ability to clean it out is what I like the most.", "Loved this because it fits in the side pockets of my fjällräven backpack.", "My husband and I just completed the Camino de Santiago (Francés) in May.  This water bottle was awesome!  I was able to use the \"cup\" on several occasions for wine and for mixing ibuprofen powder for discomfort. This bottle was a \"hit\" on the Camino when seen by other \"pilgrims\"!  Would buy again for general use....and it is a favorite Camino \"keepsake\" of mine.  😁", "I love this bottle—its light weight, and the design which makes it easy to use and clean. But I have owned 2 of them, and both cracked (so they leaked) within a month of easy usage. I’ve never had another water bottle crack before. So unfortunately I returned the most recent, and will not buy again.", "If you're considering this size bottle, get another design. This narrow plastic bottle topples over very easily. The plastic materials are quite flimsy. Used once and ended up in a pile of bottles.", "I like the option of using a cup for taking medication/pills or young children can hold the cup for drinks. A small bottle top for a quick drink. A larger opening for adding ice cubes. Small enough to fit in small backpack purse. Fits in my small hands well.  So far no leaks noticed.", "The main reason I bought this bottle is because it actually fits into small water bottle holders on bags, purses, etc.  My only complaint is that it does leak a little if you don't get the top on really tight.", "I ordered this bottle 2 years ago and love it so much that I ordered 3 more.  It’s great as a water bottle and also because of the top that turns into a drinking cup I use it to take other beverages to outdoor gatherings.  It washes up beautifully.  Would highly recommend.", "Ordered this as a Christmas present for my daughter. I only received the cup/lid. No bottle in sight...", "Good lightweight durable bottle.  Top is easy to grip and also acts as a cup if one doesn’t want to drink directly out of bottle.  I was originally gifted two of these by someone who stayed in my airb&b and worked for the company.  Liked them so much I reordered when I lost my second one."]}