{"product_url": "https://www.amazon.com/POTATOES-RUSSET-FRESH-PRODUCE-LBS/dp/B00B8SZWCO", "product_name": "POTATOES RUSSET FRESH PRODUCE 10 LBS", "description": "Russet potatoes are high in starch. Russet are perfect to cook mashed potatoes and also are good for baking.", "price": "14.98", "currency": "$", "product_rating": "4.0", "Color": ["russet potatoes"], "availability": true, "shipping": false, "delivery_date": null, "delivery_cost": null, "warranty": false, "warranty_policy": null, "condition": "new", "image": "https://m.media-amazon.com/images/I/31nbqyyeRpL._QL70_ML2_.jpg", "latest_reviews": [{"reviewer": "eric quigley", "rating": "5.0", "comment": "Received potatoes in a box. They were in great condition -shipped from California to South Carolina in about three days. Tastes fresh and lasted two weeks after delivery till I ate them all. I would order again if had too."}, {"reviewer": "Paula", "rating": "5.0", "comment": "A little smaller than I was expecting but they were a perfect size for even baking. No hot spots or nasty odd tastes.  These potatoes even lasted 2 weeks with no discoloration or bad flavor. These potatoes were hand picked for my order.  They are delivered to your door!"}, {"reviewer": "L. Manzell", "rating": "1.0", "comment": "In comparison with retail store bought potatoes, for the 5 pounds I purchased it was not thrifty."}, {"reviewer": "Ann L. Hamil", "rating": "5.0", "comment": "Arrived very early and in perfect condition"}, {"reviewer": "KRK", "rating": "4.0", "comment": "The flavor of these potatoes is very good. The quality of the potato is good, with white firm insides. Their oblong shape makes it difficult to use them for roasting and as a baked potato.... its a perfect for a youngster such as a toddler or elder who does not eat much. They are not large enough for my over six year old nephews unless I made two each."}, {"reviewer": "kyle", "rating": "5.0", "comment": "Perfect had two small ones I threw out will order when I eat these thank you"}]}