{"product_url": "https://www.amazon.com/Northshire-Farms-Kennebec-Potatoes-lbs/dp/B00PAVND1C", "product_name": "Kennebec Potatoes - 2 lbs", "description": "Our Kennebec seed potatoes are considered a \"gourmet\" potato variety, one used by some of the best chefs in the finer restaurants, especially for their French fries! Though its been around for more than 52 years, this seed potato is just now receiving the accolades it deserves. Having a light tan skin and relatively uniform appearance with few eyes and a nicely oval shape, it not only slices well for America's favorite potato dish, French fries, but it looks good on the plate when baked \"au naturale\" and performs just as well when mashed, scalloped, roasted, boiled, steamed or made into hash browns or potato salad. Kennebec Seed Potatoes Thin-skinned Kennebec peels well, but is just as yummy, and definitely better for you, when used unpeeled. For an all-around versatile and flavorful potato, choose Kennebec. The Kennebec seed potato matures in 80-100 days. Plant in full sun. Plant 9-12\" apart. Highly resistant to blight and resistant to most other common potato diseases and viruses. Stores very well.", "price": "26.59", "currency": "$", "product_rating": "2.8", "Color": [], "availability": false, "shipping": false, "delivery_date": null, "delivery_cost": null, "warranty": false, "warranty_policy": null, "condition": "new", "image": "https://m.media-amazon.com/images/I/51SbB8DiJ4L._SX300_SY300_QL70_ML2_.jpg", "latest_reviews": ["Not for eating. these are for planting only.", "These are the starter potatoes. They are used for growing, not eating.", "3 or 4 bad in bag.  Stink.", "The picture is not what I received.  They were to black and rotten to plant.  Very disported.  To rotten to return.  Guess I am out what was paid.  Dis not deserve even a one star rating, but I have too for submittig.", "I ordered these potatoes because I am a temporary shut-in and yet I had a desire to make potatoe salad.  They arrived dirty, soft and inedible.  I had to throw out each and every spud.  I will certainly not be reordering these potatoes again and cannot recommend them.", "Rotten", "Not a lot of eyes, but the potatoes grew!  and that's what we want!  No complaints, the order cam on time."]}