{"product_url": "https://www.amazon.com/Potatoes-Idaho-Russet-Produce-Bundle/dp/B00NS3RCNE", "product_name": "Potatoes Fresh Idaho Russet and Red Produce Bundle", "description": "Brand: Idaho 08/21/2017\nNumber of Items: 2\nUnit Count: 10 pound\nTemperature Condition: Fresh\nSpecialty: No Preservatives", "price": "31.49", "currency": "$", "product_rating": "2.9", "Color": [], "availability": true, "shipping": true, "delivery_date": null, "delivery_cost": null, "warranty": false, "warranty_policy": null, "condition": "new", "image": "https://m.media-amazon.com/images/I/51hutf+vxrL._SY300_SX300_.jpg", "latest_reviews": ["Way overpriced! $32 for 9 potatoes and they weren't even good quality potatoes, several were deformed and misshapen! The red potatoes had already started to grow eyes. Never again! Skip this seller!", "The potatoes I purchased from Goldrivers were packaged and delivered just as promised! The potatoes them selves were delicious and I not only would, but have referred friends and a couple family members to purchase this product also. Thank you Goldrivers for an outstanding product and actually receiving it as promised. It is hard to find good service in this day and age!!!!! VERY SATISFIED!! Eddie B. Morain Sr.", "Poor quality or the price", "The  contents of the box was as follows:\n8 ea. red potatoes that were anywhere from 2\" to 3 1/4\" in diameter, which is about average for red potatoes found in a market produce section.\n5 ea. \"Russet potatoes\" that were no larger than 3 1/4\" in length by 2 1/4 to 2 1/2\" thick...roughly the size of a tennis ball in volume.\nI've been produce shopping for over six decades and the average market price for this selection would not exceed $5-6.00 anywhere.  Add an additional $3-4.00 for handling and convenience of delivery (it took 7 days from time of ordering to delivery) and one would expect a total cost around $10.00 +/-  The actual cost was $18.75.  The condition of the red potatoes was acceptable, however, the Russets were marginal at best.  I concluded that this was not a reasonable value for one's shopping dollar.  This is price gouging in its truest sense.", "Both varieties of these potatoes are beautiful, delicious and storing very well. I'm very happy with this product and purchase. I will DEFINITELY be ordering only these potatoes as long as they're available. Zero complaints...I love these spuds!!!", "Just a few potatoes in a box, some of them good, some just okay. Very pricey.", "MOVES THROUGH NEW YORK CITY BUYER BEWARE, my box was broken open and I got about $2 worth of potatoes a total and complete rip off"]}