{"product_url": "https://www.amazon.com/Generic-Yellow-Potatoes-NON-GMO-Pounds/dp/B0D6M2HW23", "product_name": "Generic Yukon Gold Fresh Yellow Potatoes, USA GROWN, NON-GMO, Bulk (5 Pounds)", "description": "Yukon Gold potatoes are a versatile and delicious variety that have become a staple in many kitchens. These potatoes have a smooth, buttery texture and a rich, creamy flavor that sets them apart from other varieties. Their thin, golden skin and bright yellow flesh make them visually appealing, while their low to medium starch content ensures they hold their shape well during cooking. Yukon Golds are perfect for roasting, mashing, baking, or frying into crispy fries or potato wedges. Whether you're looking to add a burst of flavor to your classic potato dishes or experiment with new recipes, these potatoes are a reliable choice. With their excellent taste and texture, Yukon Golds are sure to become a go-to ingredient in your kitchen.", "price": "25.95", "currency": "$", "product_rating": "2.4", "Color": ["initial"], "availability": true, "shipping": false, "delivery_date": null, "delivery_cost": null, "warranty": false, "warranty_policy": null, "condition": "new", "image": "https://m.media-amazon.com/images/I/51m5H0SFcbL._SX300_SY300_QL70_ML2_.jpg", "latest_reviews": [{"rating": "1.0", "title": "PRICE!!!", "review": "I didn't like the product because of the price. For what you actually receive and the price you pay is absolutely ridiculous. $16 for a 1 lb bag of potatoes. Never again"}, {"rating": "5.0", "title": "Sized just right for boiling.", "review": "Arrived fresh without blemishes.  These were boiled, drained, buttered, then served.  Needed a bit more salt for our taste."}, {"rating": "2.0", "title": "My potatoes were old", "review": "My potatoes were old. All I could do is mash them."}, {"rating": "1.0", "title": "A suspect name", "review": "Gold potatoes are not yellow potatoes, so there is something false in the name given this item.  (Golds are a cross between yellows and whites.)"}]}