{"product_url": "https://www.amazon.com/Russet-Potatoes-Premium-Produce-Vegetables/dp/B00B0M2WZ8", "product_name": "Russet Idaho Potatoes Fresh Premium Fruit and Produce Vegetables, 4 pound case", "description": "Despite the popular misconception that potatoes are fattening, baked potatoes can be used as part of a healthy diet", "price": "26.59", "currency": "$", "product_rating": "3.7", "Color": [], "availability": true, "shipping": false, "delivery_date": null, "delivery_cost": null, "warranty": false, "warranty_policy": null, "condition": "new", "image": "https://m.media-amazon.com/images/I/21-iecFuJ8L._QL70_ML2_.jpg", "latest_reviews": ["These are good to taste.Baking whichever way you want to cook these love them.", "the potatoes were great.", "This is a wonderful company. They are so nice and their products are great! Please support this company. They have helped me and family during hard times. When I get out of this situation I'm in right all of my potatoes, onions and everything else the have to offer is coming from this company. And their products are very fresh and great! Wonderful company!", "The potatoes are very small and overpriced for the weight. They are in good condition; meaning upon arrival, they weren't bruised and old.", "Not food grade packaging!!!!!!!! Not special potatoes as far as I could tell.... definitely not worth what I paid.", "Arrived quickly. Very large, fresh potatoes. Overpriced but at the time were difficult to find in the markets.", "Sold as SEED potatoes. I could have purchased a bag of potatoes from any store at a fravtion of the cost. POOR!", "Fresh potatoes , I buy them all time , always great! Thanks sue", "Not one of these poatatoes sprouted. I tried to start them in a window.. no luck I put them in the ground nothing.", "I bout these for planting they did not grow not any of them I will never buy from this company again ....", "Looked like beautiful potatoes for the oven but did not grow. All my other potatoes are growing well. These russets nothing", "Product was sprout inhibited. 3 months no sprouts. Total rip off.", "These were supposed to be seed potatoes.  Followed the instructions carefully.  All 33 plugs just rotted away in the ground.  Have planted potatoes for many years with almost 100% success.  This was a total failure.", "I searched for 'seed potatoes' - I saw these were russets and bought them - when they got here there were 4 huge potatoes - I looked at my order and NOWHERE does it say they are seed potatoes.  It is my understanding that if they are not seed potatoes they are treated to prevent sprouting and if we're lucky enough to get any potatoes they will not be plantable.  In short I believed for over a month that I have purchased four VERY expensive bakers.  Was very angry to think that I got tricked like that.  The potatoes were ineligible for return and I just set the box aside and forgot about it for a about a month.  Now they are sprouting.  I will be planting them and will come back and edit my response again to let you know what happens next.", "They were not fresh and not premium quality."]}